[
  {
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxOd3M0SXhGbEZBblZjTGxKcWsxaHJWR1JZRmtURzdNaUFLMFNYRUI3MUkzTEphZ192ZHgwcnJRdlVxYjFJSnFXREJ0MUVzd25UUS1IZVQzX2taeHFHZXZBdlo5TVBhWUs5RGZQUTVYYkhqdEYzVHFwbW00N0MzcXlRdFFRQWpoWTR0LUkzT2RtQ19fU1RZOFpLLTZ4d2pLY2ZCcW5adXA5RDBFRmVzOGZ0bU1uRzBzcGswQnVxS0IwSzdpSFBkU19rcWtEYUxkRVXSAdQBQVVfeXFMTU1RQkljSjBuWGotVEd3SlIzbC14ODZIUmtITWpCYU5lM0JsaXdxTlU1VXBiVGM2T01sU3lFWDlGbU4zdmU2MXU0NmZQSWNPTG85akE2Vk0xNnNZV2kwQXh2Z2dhS0MwcEFCM1o1ckx6UHoxN0h5NElIN2ZlRnFacm9fY2ZJanJTS1NzZlJwR0VfY29WcmI1ZUpRcVRnc2h6UzA5RUxsb1lMWUNpcGpNd1o1X2Rrb0NsRkVCeEU1a0hmclhZUU5kcklRSzFuUTZDaW1xNTQ?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+OR+company+OR+earnings&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Tue, 29 Jul 2025 05:51:45 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMizwFBVV95cUxOd3M0SXhGbEZBblZjTGxKcWsxaHJWR1JZRmtURzdNaUFLMFNYRUI3MUkzTEphZ192ZHgwcnJRdlVxYjFJSnFXREJ0MUVzd25UUS1IZVQzX2taeHFHZXZBdlo5TVBhWUs5RGZQUTVYYkhqdEYzVHFwbW00N0MzcXlRdFFRQWpoWTR0LUkzT2RtQ19fU1RZOFpLLTZ4d2pLY2ZCcW5adXA5RDBFRmVzOGZ0bU1uRzBzcGswQnVxS0IwSzdpSFBkU19rcWtEYUxkRVXSAdQBQVVfeXFMTU1RQkljSjBuWGotVEd3SlIzbC14ODZIUmtITWpCYU5lM0JsaXdxTlU1VXBiVGM2T01sU3lFWDlGbU4zdmU2MXU0NmZQSWNPTG85akE2Vk0xNnNZV2kwQXh2Z2dhS0MwcEFCM1o1ckx6UHoxN0h5NElIN2ZlRnFacm9fY2ZJanJTS1NzZlJwR0VfY29WcmI1ZUpRcVRnc2h6UzA5RUxsb1lMWUNpcGpNd1o1X2Rrb0NsRkVCeEU1a0hmclhZUU5kcklRSzFuUTZDaW1xNTQ?oc=5\" target=\"_blank\">Fed likely to hold rates, no cuts before September: Matt Orton</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMizwFBVV95cUxPRGhQM3RzLTVCNVF3RkY4eGZnV2JzSVpoSGcwdU5Ma0QtVmlRZUZBdk1CazF4SnRFSTM0N2FlWk9IQ09zVWRoLXZkU0dZMDhFTHVsVDRrRHFmS2V2ZEd4Vm5ieG9Da05HejM1cVg2aXNsZ1Rld3YxaVBiNnAwZU9PTTUzQnYtd1d4Y2dxWmdmMGU2R1l1VzZhR2RHOFFQbG5DOENnYUxuR3RNbDJQUHFiTmNFOFowUUhkWDF3bkZGTGFldVozd25KUXBXS0ZqNnfSAdQBQVVfeXFMTVZVUzVhVnNUNndKcEZ3OWZZM19vTF9XYXhLcjJObU1fNXVBbGV5NkdldmdUdnAzYWxmU0dWaHY5MFBNY3ZLMzY0bktMbEJIblc5WTFZUE5PX1RGVW00OHJIZWhJMkFIbWVqdnBzYm1kSTNnaGVDcklqN09IQVRUTUJHYzFtQTNOSVBoOG95WkhmRzloXzQ5dFBLbkZBN3R4WEFwTU1xTzJUcmdfaTJvNmpMWHNZVVFIT05iWnNySE5QOUJjUW5haXRqaTQ2ZGFkR0dycjE?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+OR+company+OR+earnings&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Tue, 29 Jul 2025 06:37:26 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMizwFBVV95cUxPRGhQM3RzLTVCNVF3RkY4eGZnV2JzSVpoSGcwdU5Ma0QtVmlRZUZBdk1CazF4SnRFSTM0N2FlWk9IQ09zVWRoLXZkU0dZMDhFTHVsVDRrRHFmS2V2ZEd4Vm5ieG9Da05HejM1cVg2aXNsZ1Rld3YxaVBiNnAwZU9PTTUzQnYtd1d4Y2dxWmdmMGU2R1l1VzZhR2RHOFFQbG5DOENnYUxuR3RNbDJQUHFiTmNFOFowUUhkWDF3bkZGTGFldVozd25KUXBXS0ZqNnfSAdQBQVVfeXFMTVZVUzVhVnNUNndKcEZ3OWZZM19vTF9XYXhLcjJObU1fNXVBbGV5NkdldmdUdnAzYWxmU0dWaHY5MFBNY3ZLMzY0bktMbEJIblc5WTFZUE5PX1RGVW00OHJIZWhJMkFIbWVqdnBzYm1kSTNnaGVDcklqN09IQVRUTUJHYzFtQTNOSVBoOG95WkhmRzloXzQ5dFBLbkZBN3R4WEFwTU1xTzJUcmdfaTJvNmpMWHNZVVFIT05iWnNySE5QOUJjUW5haXRqaTQ2ZGFkR0dycjE?oc=5\" target=\"_blank\">Asian shares dip as US-EU tariff deal raises growth, inflation fears</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Business Standard</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQT1YxU0oxRmVoMW5tLTV1VDl1WENIdWJpTFpxYWFyM0pBRUdZdHd3WjdkcGRibHNuVkotd0lHT3lLcW11eloyalQtLWpSYjgwUkJYMDRTVU5MN3FhdmFGTUFGb1Bib2w2SHJxaUF1M1QxQ3ZFeF9LQnY0WUd0d3NxLUx1dkl6TkRGUWZIUmQyS2NZeWZwc1lOLVRzVkJuOF9hd3RBWGc0UTRhbU5HQTdHdy1jb2R3WmhQdy1EeXpoYlI1WS14SlB1MHRuX1UyVkxNdmFKS1NZd0vSAd4BQVVfeXFMT3F0bU5sSGdud2FoZFBVMERhWVhWYnp2V2lLNmlKWE1hNHg5SDFfcVZJTHZZZW1HWGZEMkNoOHEyZzlFOFRuRjNxeUM0RDZTNUNBSmlPWk03TXlNMC1MQ3J4Q05nQVZaOEh0d2oyc2hVYnRub1FmU3QzN0VGbF9sRHFCRXNWREJUM0FEdVhaUHF1SmlzTlBTakMtbGdSeFk5VXhKX19Hazl1RkFLZmNid0pycU9FNmtxYVB2WTJYVmVyVW5HZzJvZ2hZR200TklUUDZ6bFdoODZrOHBOb0dn?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+OR+company+OR+earnings&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Tue, 29 Jul 2025 01:07:44 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi2AFBVV95cUxQT1YxU0oxRmVoMW5tLTV1VDl1WENIdWJpTFpxYWFyM0pBRUdZdHd3WjdkcGRibHNuVkotd0lHT3lLcW11eloyalQtLWpSYjgwUkJYMDRTVU5MN3FhdmFGTUFGb1Bib2w2SHJxaUF1M1QxQ3ZFeF9LQnY0WUd0d3NxLUx1dkl6TkRGUWZIUmQyS2NZeWZwc1lOLVRzVkJuOF9hd3RBWGc0UTRhbU5HQTdHdy1jb2R3WmhQdy1EeXpoYlI1WS14SlB1MHRuX1UyVkxNdmFKS1NZd0vSAd4BQVVfeXFMT3F0bU5sSGdud2FoZFBVMERhWVhWYnp2V2lLNmlKWE1hNHg5SDFfcVZJTHZZZW1HWGZEMkNoOHEyZzlFOFRuRjNxeUM0RDZTNUNBSmlPWk03TXlNMC1MQ3J4Q05nQVZaOEh0d2oyc2hVYnRub1FmU3QzN0VGbF9sRHFCRXNWREJUM0FEdVhaUHF1SmlzTlBTakMtbGdSeFk5VXhKX19Hazl1RkFLZmNid0pycU9FNmtxYVB2WTJYVmVyVW5HZzJvZ2hZR200TklUUDZ6bFdoODZrOHBOb0dn?oc=5\" target=\"_blank\">Australia shares dragged by miners, banks; investors await inflation data</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Mint</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMigwJBVV95cUxOcWVEN2tKR3p6VEp2QkI2dnZ6ZDRzd0VJeDFRbEFoWDhDRUhhX2hHcGowQ0FzYjBQOFdPd1c4ZTJFbmFhejlseXoyX0pJamt6NWFZcWxtUkp1X0FSV1ljTWNYcHQySUl0QXdSLUpYYzBOSzEyUkpfdkNnYUg2T2FDRzQ3TGJKQ3NTMnZGZ0FHUF90RVpHZG8zaG5lMnlfaVlmOU1Kc0Q0c2pOeEUwMzJRcll2a08xRmE4dTBfZTNYSHVRRHJlTW9kU201cGs5VlRMd3ZUOTNSZC1LbmFzUGtvVFpDMXlKZ3ZfMTVCdjdfVGhPQXI0Y2g2TEVMalV1anRnNkY40gGIAkFVX3lxTE1IZ0dpcHNFMlFfMVozUVhjNkRGcExFRTU2aVU1TkFNaTBxWFdKRFVOTUZKMU9TMTUxY0Q4aHR1akpreVdSUVFDNnZYQ1IxQ0tLeEprVkpKdFFPYTJSdGQ4TGc0V0Vrd3BaREUxYnhSa3NKR1ZjV3VsWHhjMEk2VnI1MHdjUUFVcGlhUmlnSzNKQ0wweDVfZW9WY2xLeFVqcS1YTURqQkJwRzRKZVBobm1wenBjQlNZTVhJRDZ6VDBYaGIxcFFobGlXQVB2MGotbWIwVzBuT1MtZHA1NzQyeVJxcWF0UFVsM3JNWmRJU3JzNl9WNXQtZ1hJR3I1Z0oza2dvck1YODhiSA?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+OR+company+OR+earnings&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Tue, 29 Jul 2025 03:16:00 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMigwJBVV95cUxOcWVEN2tKR3p6VEp2QkI2dnZ6ZDRzd0VJeDFRbEFoWDhDRUhhX2hHcGowQ0FzYjBQOFdPd1c4ZTJFbmFhejlseXoyX0pJamt6NWFZcWxtUkp1X0FSV1ljTWNYcHQySUl0QXdSLUpYYzBOSzEyUkpfdkNnYUg2T2FDRzQ3TGJKQ3NTMnZGZ0FHUF90RVpHZG8zaG5lMnlfaVlmOU1Kc0Q0c2pOeEUwMzJRcll2a08xRmE4dTBfZTNYSHVRRHJlTW9kU201cGs5VlRMd3ZUOTNSZC1LbmFzUGtvVFpDMXlKZ3ZfMTVCdjdfVGhPQXI0Y2g2TEVMalV1anRnNkY40gGIAkFVX3lxTE1IZ0dpcHNFMlFfMVozUVhjNkRGcExFRTU2aVU1TkFNaTBxWFdKRFVOTUZKMU9TMTUxY0Q4aHR1akpreVdSUVFDNnZYQ1IxQ0tLeEprVkpKdFFPYTJSdGQ4TGc0V0Vrd3BaREUxYnhSa3NKR1ZjV3VsWHhjMEk2VnI1MHdjUUFVcGlhUmlnSzNKQ0wweDVfZW9WY2xLeFVqcS1YTURqQkJwRzRKZVBobm1wenBjQlNZTVhJRDZ6VDBYaGIxcFFobGlXQVB2MGotbWIwVzBuT1MtZHA1NzQyeVJxcWF0UFVsM3JNWmRJU3JzNl9WNXQtZ1hJR3I1Z0oza2dvck1YODhiSA?oc=5\" target=\"_blank\">Asian markets slip: Tariff talks cloud investor sentiment; US-China talks cast shadow</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Times of India</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNdEU4X0d2SVM0djlUNzcwQ2RnNU1NYTJLdS1vdUZSMXRGZUlFeVFMdldrY3ZqdjhfWXUzbzVMb2dua0FtekJPOTM2U1h1bzZBV0lsN3M0UW1WZFo2TW9MS2tuY2hRMTZHUmNQdi12MlNCNE5uWktZR18wRTgwcGYzeVg2UkJqTEMzbDU0OXdjbXJGQQ?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+OR+company+OR+earnings&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Mon, 28 Jul 2025 21:50:23 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxNdEU4X0d2SVM0djlUNzcwQ2RnNU1NYTJLdS1vdUZSMXRGZUlFeVFMdldrY3ZqdjhfWXUzbzVMb2dua0FtekJPOTM2U1h1bzZBV0lsN3M0UW1WZFo2TW9MS2tuY2hRMTZHUmNQdi12MlNCNE5uWktZR18wRTgwcGYzeVg2UkJqTEMzbDU0OXdjbXJGQQ?oc=5\" target=\"_blank\">What To Expect From Thursday's Report On Inflation</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Investopedia</font>"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/expert-view/fed-likely-to-hold-rates-no-cuts-before-september-matt-orton/articleshow/122967599.cms",
    "title": "Fed likely to hold rates, no cuts before September: Matt Orton",
    "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\n\"If you think back to April 2nd, on Liberation Day, we were penciling in tariff rates of over 50% for many countries globally. So the fact that we’re now settling into a 15%–20% range is generally manageable. The company management teams I speak to — both in the US and globally — feel this is a range they can work within. It doesn’t mean there won’t be challenges, particularly for certain industries, but overall, we at least have some clarity. This removes the worst-case scenarios from the table and allows us as investors to focus on what truly matters: company-specific fundamentals and earnings trajectories,\" says Matt Orton I’ve been constructive on the outlook for markets, particularly US equities. The trade deals that are being signed and the narrowing of the tariff bands are all marginal positives — not just for the US economy, but for the global economy more broadly.If you think back to April 2nd, on Liberation Day, we were penciling in tariff rates of over 50% for many countries globally. So the fact that we’re now settling into a 15%–20% range is generally manageable. The company management teams I speak to — both in the US and globally — feel this is a range they can work within. It doesn’t mean there won’t be challenges, particularly for certain industries, but overall, we at least have some clarity. This removes the worst-case scenarios from the table and allows us as investors to focus on what truly matters: company-specific fundamentals and earnings trajectories.What we’re seeing in the US right now — and why it’s outperforming other global markets — is strong Q2 earnings. Companies are not only reporting solid top-line growth, but also strong margins, indicating that the tariffs implemented so far haven’t significantly impacted their bottom lines. That’s why there’s a sense of optimism. I remain optimistic and continue to advise clients to use any downside as an opportunity to ensure their portfolios are well-balanced and positioned toward durable secular growth themes.Right now, oil markets are largely range-bound, barring any major geopolitical escalation. We saw a glimpse of potential volatility during the brief standoff with Iran, but since then, oil prices have settled into a range aligned with supply-demand fundamentals.I don't expect sustained prices above $75–$78 per barrel unless there’s significant geopolitical conflict. That’s generally good news for emerging markets. As you rightly pointed out, the current range is manageable for an economy like India.The key question is how India proceeds with trade negotiations with the US. There’s potential for India to leverage a trade deal to increase purchases of US oil, potentially replacing Russian supply. That’s one of the scenarios still in play.I also expect rates to be held steady — that’s pretty much the consensus view at this point. As you mentioned, what really matters is how hawkish Powell sounds during his commentary.I suspect he’ll try hard to avoid saying anything new and steer clear of speculative questions — like whether he plans to step down or whether Trump might replace him. That’s just noise. Ultimately, the Fed is governed by a committee of voting members. At most, we may see two dissenting votes in this meeting.I don’t expect any rate cuts before September. The US economy is still holding up well, inflation is relatively stable, and we’re not yet sure how tariffs will fully pass through. There’s no compelling reason to preemptively cut rates.My base case is that we’ll see one or two cuts later this year — but not until at least September, and more likely in November or December.The long-term trajectory for the dollar is still downward. The recent uptick is more technical in nature — driven by some profit-taking following the dollar’s poor performance in the first half of the year.I believe the downtrend will resume, which is one reason I remain optimistic about emerging markets. They offer strong diversification, especially for portfolios that are currently overweight on US equities.I would use market weakness to buy into high-quality companies across emerging markets. India is definitely one of the most promising countries in this space. The recent FII selling appears shortsighted, likely influenced by developments in China.India’s long-term outlook remains strong. I particularly like companies in the banking sector, some automakers, and firms integrating AI into their businesses. Their earnings results so far have been very strong. So I’m using the current market conditions to build positions in specific names in anticipation of a return to favor for emerging markets — with India leading the charge.",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Tue, 29 Jul 2025 11:21:45 +0530",
    "summary": "Matt Orton from Raymond James Investment suggests that manageable tariff ranges and strong Q2 earnings are fueling optimism in US markets. While oil price stability is beneficial for emerging markets like India, trade negotiations with the US remain crucial."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/monarch-surveyors-ipo-set-for-listing-today-84-gmp-signals-robust-debut/articleshow/122964242.cms",
    "title": "Monarch Surveyors shares list at 69% premium over IPO price on BSE SME platform",
    "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nShares of Monarch Surveyors and Engineering listed with a premium of 68.5% on Tuesday. The stock debuted at Rs 421.25 on the BSE SME platform.The Rs 94 crore IPO, which ran from July 22 to July 24, saw overwhelming investor interest across categories. The issue was subscribed a massive 250.65 times overall, with retail investors bidding 263.01 times, non-institutional investors (NIIs) 317.05 times, and qualified institutional buyers (QIBs) 179.01 times.Monarch Surveyors provides end-to-end civil engineering consultancy services such as surveying, GIS mapping, geotechnical investigations, feasibility studies, and project management.The company’s client base includes entities from the roads, railways, ports, and oil and gas sectors. As of March 2024, the company had 417 employees and a diverse project portfolio across infrastructure verticals.Financially, the company reported consistent growth with FY25 revenue rising 10% YoY to Rs 155.66 crore and profit after tax (PAT) up 16% to Rs 34.83 crore.With aggressive subscription figures, and a steep GMP of 84%, Monarch Surveyors’ listing is likely to be solid. All eyes will now be on whether the stock can sustain its premium in the sessions post-listing.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Tue, 29 Jul 2025 07:51:28 +0530",
    "summary": "Monarch Surveyors and Engineering shares debuted strongly. The listing occurred on the BSE SME platform with a significant premium. The IPO witnessed substantial oversubscription across all investor categories. The company provides civil engineering consultancy services. It serves clients in roads, railways, and other sectors. The company reported revenue and profit growth."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/jane-street-to-argue-that-retail-demand-drove-its-india-trades/articleshow/122963245.cms",
    "title": "Jane Street to argue that retail demand drove its India trades",
    "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Tue, 29 Jul 2025 06:07:27 +0530",
    "summary": "Jane Street Group is contesting market manipulation allegations in India, claiming its controversial options trades responded to high retail investor demand. The firm argues it facilitated options bets, hedging less to minimize market impact. While SEBI scrutinizes Jane Street's activity, the case tests India's regulatory framework amid growing global trading complexities."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-tcs-layoffs-affect-indias-real-estate-sector/articleshow/122962919.cms",
    "title": "How will TCS layoffs affect India's real estate sector?",
    "content": "Live Events\n\nAgencies\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nMumbai: India's real estate stocks tumbled on Monday as layoffs at the country's largest IT services firm, Tata Consultancy Services (TCS) cast a shadow on housing demand from software professionals. The selloff in real estate was broad-based, with all 10 index constituents ending in the red. Lodha Developers was the biggest laggard, falling 6.31%, followed by Godrej Properties (-5.44%), Brigade Enterprises (-4.41%) and DLF (-4.30%).\"If layoffs do materialise, it could significantly impact real estate sales, especially in IT-driven markets like Bengaluru,\" said Sneha Poddar, VP - Research, Wealth Management at Motilal Oswal Financial Services TCS plans to reduce its workforce by approximately 2%, or 12,000 employees. Investors worry that other IT bigwigs may follow suit.Historically, whenever the IT sector has faced slowdowns or job losses, the real estate market in these regions has seen a corresponding dip. The Bengaluru market is likely to feel the most immediate impact, with a possible ripple effect across other metro cities like Mumbai and Hyderabad, Poddar added.Vikram Kasat, head - advisory at PL Capital, noted that the Nifty Realty Index has already corrected more than 26% from its peak, making it one of the most vulnerable sectors in 2025. He advised investors to focus on blue-chip developers with strong fundamentals and use any weakness as a buying opportunity.He also cautioned that realty firms in South India could be hit harder due to their dependence on IT-driven demand.While many companies have a strong pipeline of projects and new launches, analysts said the actual conversion into sales and cash flow has fallen short. This is especially concerning for the industry because pre-sales and collections are among the most critical metrics for assessing real estate health.Some analysts remain optimistic about the sector's prospects. Pankaj Kumar, VP-Fundamental Research at Kotak Securities, expects residential developers to post strong results in Q1FY26He said valuations are attractive, with most listed developers trading at 8-11 times adjusted Enterprise Value (EV) to EBITDA, a key profitability metric used to compare companies on operating earnings relative to their valuation.The outlook could further improve following RBI's recent 50 basis point interest rate cut.",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Tue, 29 Jul 2025 05:44:34 +0530",
    "summary": "Indian real estate stocks plunged following layoffs at TCS, raising concerns about decreased housing demand from IT professionals, particularly in Bengaluru. Analysts predict a potential ripple effect across major metro cities, with the Nifty Realty Index already significantly corrected. Despite concerns, some analysts remain optimistic, citing attractive valuations and potential benefits from recent interest rate cuts."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/expert-view/market-may-inch-upward-gradually-after-digesting-weak-q1-results-global-noise-neeraj-dewan/articleshow/122969142.cms",
    "title": "Market may inch upward gradually after digesting weak Q1 results, global noise: Neeraj Dewan",
    "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\n\"These are the two or three key factors dragging the market. However, on the domestic front, the macro setup looks decent—monsoons have been good so far, interest rates remain low, and liquidity is improving. These factors should bode well for the second half of the year. The third and fourth quarters could see better performance,\" says Neeraj Dewan , Market Expert.Yes, so far, the earnings have been quite mixed. As you mentioned, there has been disappointment in IT and banking numbers. Even some infrastructure companies haven’t reported very encouraging results. June was expected to be a weak quarter, but even with those low expectations, the numbers have underdelivered, and that’s something the market is reacting to.Secondly, the delay in the tariff settlement with the US is also weighing on market sentiment. I believe this will get resolved sooner or later. Another concern is the noise around Russian oil—if the US, possibly under Trump, decides to impose fresh sanctions, that could impact us. We’ve been benefiting from discounted Russian oil, so any disruption there would be a concern.These are the two or three key factors dragging the market. However, on the domestic front, the macro setup looks decent—monsoons have been good so far, interest rates remain low, and liquidity is improving. These factors should bode well for the second half of the year. The third and fourth quarters could see better performance.So, after the ongoing market correction, I expect some constructive movement. The market should gradually move higher, now that results are in and we have clarity on interest rates, liquidity, and management commentary on order flows and execution. For instance, L&T’s results today will be important to see if execution has picked up and what kind of order inflows they’re reporting.Based on all this, we can build a constructive investment pitch for the rest of the year. Banking is one area I believe still has potential. While Kotak and Axis showed some stress pockets, there were also some positives—like Kotak suggesting MFI stress may have peaked. Bank credit should pick up, and once it does, the banking space should benefit. Valuations are still very attractive, especially for PSU banks Some NBFCs have also done well this quarter and could continue to perform. The infrastructure and capital goods sectors are also looking promising. As for IT, while the numbers weren’t great, they weren’t disastrous either. So the downside may now be limited, but it's still difficult to justify fresh buying at this point. It’s better to wait and watch for now.Yes, you’re right. As you said, Kotak and Axis Bank numbers weren’t great. But ICICI Bank did very well, and HDFC Bank also posted a reasonably strong set. PSU banks, in particular, are trading at very attractive valuations, and their books are clean.There was concern this quarter around NIM pressure and MFI stress, and these issues were visible in the reported numbers. But going forward, I believe MFI-related stress may subside as liquidity in the system improves. If we enter the festive season with a good monsoon and favorable economic conditions, that could ease some of the current concerns.As for NIM pressure—this is a common occurrence when interest rate cycles reverse—but as credit demand picks up, this should also ease. So while this quarter’s results were mixed, I remain positive on the banking space looking ahead.For now, it’s better to stick with the leaders. I’m a bit cautious on Axis Bank given its recent results and concerns around asset quality. I would prefer to watch a few more quarters before taking a call there.Kotak Bank, despite disappointing numbers, may be the better of the two. If you see a meaningful decline in Kotak Bank, it could be considered, especially given their strong track record—even during the RBI embargo period, they managed well and bounced back strongly.But otherwise, I’d recommend sticking with leaders like ICICI Bank, which has posted a strong set of numbers. I also continue to like PSU banks due to the comfort in their valuations. If credit demand improves, they stand to benefit meaningfully because of the levels at which they’re currently trading.",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Tue, 29 Jul 2025 12:23:06 +0530",
    "summary": "Market expert Neeraj Dewan shares insights on current market dynamics. He notes mixed earnings, especially in IT and banking sectors. Delay in US tariff settlement and concerns about Russian oil impact market sentiment. Dewan highlights positive domestic factors like good monsoons and improving liquidity. He suggests banking, infrastructure, and capital goods sectors show promise."
  },
  {
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxNSE1YRHlDZW1TT0dubG9NUDZqQXFLbXo2SWhhWHo3bWtjSFVRaGZVOFFCeF9SVV9HN25GQzU0OHZtem5kZDJMbkZVT3B3NHhLamxva2MyUEUxLTdjaUFSMTNOd1dBVlVtcUN6TnNDYXhUVVgwLVRyVXpVS2pLMTEweFM1V2VsUTh0VUlnWVBQYUE3RnFMV3U3RnVWOE9qU3dYOVNiZjFyUmpuWXdGTV9vVGt1MFV6ZEpxeEV1dHJoOU1EWUtaZVByLWE5a3JwUQ?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Tue, 29 Jul 2025 06:21:59 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMizgFBVV95cUxNSE1YRHlDZW1TT0dubG9NUDZqQXFLbXo2SWhhWHo3bWtjSFVRaGZVOFFCeF9SVV9HN25GQzU0OHZtem5kZDJMbkZVT3B3NHhLamxva2MyUEUxLTdjaUFSMTNOd1dBVlVtcUN6TnNDYXhUVVgwLVRyVXpVS2pLMTEweFM1V2VsUTh0VUlnWVBQYUE3RnFMV3U3RnVWOE9qU3dYOVNiZjFyUmpuWXdGTV9vVGt1MFV6ZEpxeEV1dHJoOU1EWUtaZVByLWE5a3JwUQ?oc=5\" target=\"_blank\">India's economy enters Q2 FY26 on relatively firm footing: Govt</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Fibre2Fashion</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMicEFVX3lxTE9rN0NGNU9FdzVmWTRac3k1Y2Vzd3czVXB6YzRnVEhLZGNrZHM1SkJqZE42WlhKdHRSSlktdzRmalAyblUtOHJXV2tONFRhLWJCbHNTdzlIUGVfcVQteGo5cDdRcDhHWnVvbVVYOTBzT1Q?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Mon, 28 Jul 2025 04:00:43 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE9rN0NGNU9FdzVmWTRac3k1Y2Vzd3czVXB6YzRnVEhLZGNrZHM1SkJqZE42WlhKdHRSSlktdzRmalAyblUtOHJXV2tONFRhLWJCbHNTdzlIUGVfcVQteGo5cDdRcDhHWnVvbVVYOTBzT1Q?oc=5\" target=\"_blank\">What India’s economy can teach the UK</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Financial Times</font>"
  },
  {
    "url": "https://www.moneycontrol.com/news/local-markets/taking-stock-market-fails-to-holdto-day39s-gains-ends-marginally-higher_17531871.html",
    "title": "Taking Stock: Market fails to hold on to day's gains, ends marginally higher",
    "content": "Market Today\n\nThe Indian market squandered most of the day’s gains in last-hour selling on April 23 and closed with modest gains to end higher for a third session in a row.\n\nAt close, the Sensex was up 89.83 points, or 0.12 percent, at 73,738.45, and the Nifty was up 31.60 points, or 0.14 percent, at 22,368.\n\nStory continues below Advertisement Remove Ad\n\nThe market opened in the green on positive global cues as fears of an escalation in West Asia eased and volatility feel sharply. However, profit booking in the final hour erased most of the gains.\n\nGrasim Industries, Bharti Airtel, Nestle India, Maruti Suzuki and HCL Technologies were among major Nifty gainers, while losers included Sun Pharma, BPCL, Reliance Industries, M&M and Hindalco Industries.\n\nAmong sectors, healthcare, metal, oil & gas and energy were down 0.3-0.8 percent, while FMCG, power, IT, realty and auto were up 0.4-2 percent.\n\nThe BSE midcap index rose 0.5 percent and the smallcap index gained a percent.\n\nAmong individual stocks, a volume spike of more than 900 percent was seen in Balrampur Chini Mills, Bandhan Bank and Metropolis Healthcare.\n\nA long build-up was seen in Aditya Birla Fashion & Retail, Aditya Birla Capital and Multi Commodity Exchange of India, while a short build-up was seen in Mahindra & Mahindra Financial Services, ABB India and Sun Pharma.\n\nStory continues below Advertisement Remove Ad\n\nMore than 250 stocks touched their 52-week high on the BSE, including Aditya Birla Capital, Amara Raja Batteries, Arvind, Bharti Airtel, Cochin Shipyard, Cummins India, Eicher Motors, Grasim Industries, Indraprastha Gas, LIC Housing Finance, Maruti Suzuki, Max Financial, MOIL, Sobha, Sterling Wilson, Sudarshan Chemicals, Tejas Networks, Voltas, among others. Click to view full list\n\nOutlook for April 24\n\nAditya Gaggar Director of Progressive Shares\n\nRange Bound trade comes to an end higher at 22,368 with gains of 31.60 points. Among the sectors, Realty gained over 2.6% and registered itself as a top gainer followed by FMCG and Media; and on the flip side, Pharma (0.90%) corrected the most.\n\nDuring the day, Chemical and Railway counters regained their lost momentum by breaching their congestion zone. The interest of market participants was more towards Broader markets as Mid and Small Caps gained over 1% and outperformed the Frontline Index.\n\nAs mentioned yesterday, the Index found resistance at the bearish gap zone of 22,430-22,500. Our view remains the same i.e. need to fill the mentioned gap zone to extend its uptrend while a level of 22,190 (50 DMA) will continue to act as support.\n\nRupak De, Senior Technical Analyst, LKP Securities\n\nThe Nifty remained sideways throughout the session as it failed to provide any directional breakout. However, the overall trend remains positive as the index closed above the critical moving average.\n\nThe Relative Strength Index (RSI) is showing a bullish crossover with a reading below 60.\n\nOn the higher end, the range of 22350-22400 is likely to act as a resistance zone; a decisive breakout above 22400 might trigger a rally in the market. On the lower end, support is positioned at 22250; a breach below this level might weaken the bullish sentiment.\n\nDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n\nDisclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary.",
    "source": "https://www.moneycontrol.com/rss/marketreports.xml",
    "published_date": "Tue, 23 Apr 2024 15:46:31 +0530",
    "summary": "<img align=\" left\" alt=\"Taking Stock: Market fails to hold on to day#39;s gains, ends marginally higher\" border=\"0\" height=\"75\" hspace=\"5\" src=\"https://www.moneycontrol.com/news_image_files/2024/200x200/v/volatile_market1_200.jpg\" title=\"Taking Stock: Market fails to hold on to day#39;s gains, ends marginally higher\" width=\"75\" /> Grasim Industries, Bharti Airtel, Nestle India, Maruti Suzuki and HCL Technologies were the biggest Nifty gainers, while losers included Sun Pharma, BPCL, Reliance Industries, MM and Hindalco Industries"
  },
  {
    "url": "https://www.moneycontrol.com/news/local-markets/sensex-nifty-gain-for-third-daya-row-easing-volatility-to-support-bull-trend_17531821.html",
    "title": "Sensex, Nifty gain for third day in a row; easing volatility to support bull trend",
    "content": "Barring Nifty Pharma, all other sectors traded in positive territory on April 23\n\nBenchmark indices the Sensex and the Nifty extended gains for third straight day on April 23 as fear around West Asia conflict eased and a sharp drop in volatility. Most sectors traded higher, while broader indices outperformed the benchmarks.\n\nThe Sensex was up 89.83 points or 0.12 percent at 73,738.45, and the Nifty was up 31.60 points or 0.14 percent at 22,368. The market breadth was in favour of gainers — 2,151 shares advanced, 1,353 shares declined, and 89 shares unchanged.\n\nStory continues below Advertisement Remove Ad\n\nAnalysts expect the bullish undertone to continue as the Lok Sabha elections and corporate earnings season continue.\n\nALSO READ: Experts bet on these 10 stocks that may outperform market with healthy returns\n\nThe fear gauge India VIX saw its biggest fall in nearly five years, down 18 percent to 10.3.\n\nCooling volatility indicates that worries over West Asia tensions had ebbed, Ajit Mishra, Senior Vice-President of Technical Research at Religare Broking, said. He expects onset of general elections and corporate earnings season to lend support to markets in the near term.\n\n\"We expect Nifty to beat 22,600 in the next few days, followed by 22,900-23,000,\" Mishra said.\n\nAmong sectors, Nifty Realty was the top sectoral winner as it surged over 2 percent led by gains in DLF, Macrotech Developers, and Godrej Properties.\n\nStory continues below Advertisement Remove Ad\n\nALSO READ: RIL’s stellar Q4 performance delights street, spurs brokerages to raise target price\n\nTelecom stocks did well too, with the BSE telecom index surging over 4 percent on the back of gains in Tejas Networks, Vodafone Idea, and Avantel. Tejas Networks stock hit a 20 percent upper circuit after delivering an upbeat fourth quarter performance.\n\nWeakness in Sun Pharma shares due to regulatory concerns in its Dadra facility brought Nifty Pharma index down. The sector defied bullish market trends and lost 0.9 percent on April 23.\n\nFrom an investing standpoint, analysts at ICICI Securities recommend to adopt a stock-specific strategy as corporate earnings season unfolds. \" We reiterate our structurally positive stance, as we have seen in the past that once anxiety around such events settles down, markets tend to resume their primary up trend,\" they said.\n\nDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.",
    "source": "https://www.moneycontrol.com/rss/marketreports.xml",
    "published_date": "Tue, 23 Apr 2024 14:51:26 +0530",
    "summary": "<img align=\" left\" alt=\"Sensex, Nifty gain for third day in a row; easing volatility to support bull trend\" border=\"0\" height=\"75\" hspace=\"5\" src=\"https://www.moneycontrol.com/news_image_files/2024/200x200/S/Share-Market-New-4-4_200.jpg\" title=\"Sensex, Nifty gain for third day in a row; easing volatility to support bull trend\" width=\"75\" /> Analysts expect the market to maintain the bullish undertone as elections and corporate earnings season continue"
  },
  {
    "url": "https://www.moneycontrol.com/news/local-markets/mid-day-mood-|-cooling-volatility-sparks-market-rally-india-vix-sees-steepest-fall4-years_17531481.html",
    "title": "Mid-day Mood | Cooling volatility sparks market rally, India VIX sees steepest fall in 4 years",
    "content": "The market breadth was in favour of gainers on April 23 afternoon\n\nBenchmark Sensex and Nifty indices continued to trade in green on April 23 afternoon, led by gains in realty stocks. The rally helped ease market volatility as India VIX, which measures near-term volatility, fell sharply by 19 percent, last seen in May 2019.\n\nAround noon, the Sensex was up 263.09 points or 0.36 percent at 73,911.71, and the Nifty was up 83.80 points or 0.38 percent at 22,420.20. The market breadth was in favour of gainers as around 2,155 shares advanced, 1,039 declined, and 82 traded unchanged.\n\nStory continues below Advertisement Remove Ad\n\nMeanwhile, broader markets outperformed the benchmarks, with the BSE Midcap and BSE Smallcap rising up to 0.9 percent each.\n\nFollow our live blog for all the market action\n\nSectoral trend\n\nBarring Nifty Pharma, all sectors traded with gains on April 23 afternoon. Nifty Realty index was the top sectoral performer led by gains in DLF, Macrotech Developers, Godrej Properties, and Phoenix Mills.\n\nFundamental view\n\nV K Vijayakumar, Chief Investment Strategist, Geojit Financial Services said that external factors like the high bond yields in the US (the 10-year continues above 4.6 percent) and geopolitical concerns in the Middle East are not impacting the underlying bullish trend.\n\nStory continues below Advertisement Remove Ad\n\n\"FPI selling triggered by high US bond yields is neutralised by aggressive DII buying, putting the FPIs on the back foot,\" he said.\n\nTechnical view\n\nDeven Mehata, Research Analyst at Choice Broking expects Nifty to find support at 22,300 followed by 22,200 and 22,150. On the higher side, 22,450 can be an immediate resistance, followed by 22,500 and 22,550, he said.\n\nKey Nifty gainers Bharti Airtel, Grasim Industries, HCL Technologies Key Nifty losers Sun Pharma, HDFC Life, Tata Consumer Top Sensex leaders Bharti Airtel, HCL Tech, SBI Top Sensex laggards Sun Pharma, Reliance Industries, M&M\n\nPSP Projects: Shares of PSP Projects rose around 4 percent on April 23 after the company launched its its qualified institutions placement (QIP) in a bid to raise Rs 244 crore.\n\nTejas Networks: The stock was locked at 20 percent upper circuit on April 23 afternoon, a day after the company reported robust earnings for the quarter ended March 2024 with margins and revenue beating street estimates.\n\nHatsun Agro Products: The stock soared 11 percent in early trade on April 23 after the company's net profit doubled on year to Rs 52 crore in the January-March quarter.\n\nDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.",
    "source": "https://www.moneycontrol.com/rss/marketreports.xml",
    "published_date": "Tue, 23 Apr 2024 12:23:21 +0530",
    "summary": "<img align=\" left\" alt=\"Mid-day Mood | Cooling volatility sparks market rally, India VIX sees steepest fall in 4 years\" border=\"0\" height=\"75\" hspace=\"5\" src=\"https://www.moneycontrol.com/news_image_files/2024/200x200/N/Nifty_sensex_marketup-4_200.jpg\" title=\"Mid-day Mood | Cooling volatility sparks market rally, India VIX sees steepest fall in 4 years\" width=\"75\" /> Broader markets outperformed benchmarks, with the BSE Midcap and BSE Smallcap rising up to 0.9 percent"
  },
  {
    "url": "https://www.moneycontrol.com/news/local-markets/sensex-nifty-extend-gains-to-3rd-day-q4-results-to-guide-stock-specific-action_17530901.html",
    "title": "Sensex, Nifty extend gains to 3rd day, Q4 results to guide stock-specific action",
    "content": "As corporate earnings season progresses, analysts believe stock-specific action to take place\n\nThe benchmark Sensex and Nifty indices traded in the positive territory on April 23 morning backed by strong global cues. As corporate earnings season progresses, analysts believe stock-specific action will take place. However, they recommend caution, given the geopolitical uncertainties and the onset of general elections.\n\nAround morning, the Sensex was up 190.02 points or 0.26 percent at 73,838.64, and the Nifty was up 53.40 points or 0.24 percent at 22,389.80. The market breadth was in favour of gainers as around 1,963 shares advanced, 833 declined, and 94 stayed unchanged.\n\nStory continues below Advertisement Remove Ad\n\nFollow our live blog for all the market action\n\nIndia VIX, which measures the near-term volatility, saw a sharp fall of 18 percent to trade around 10.42, lowest this year. Meanwhile, the BSE Smallcap index outperformed benchmark as it surged 0.6 percent within the first hour of trade.\n\nHowever, VK Vijayakumar, Chief Investment Strategist of Geojit Financial Services recommends investors to stick with fairly valued largecaps as high valuations plague broader markets. He believes that the underlying bullish tone of the markets will continue in the near-term as FPI selling may get neutralised by aggressive domestic buying.\n\nDeepak Jasani, Head of Retail Research, HDFC Securities forecasts Nifty to stay within 22,213-22,504 band in the near-term. \"We believe that Nifty has reversed its downward trend and is now expected to head higher,\" he said.\n\nAmong sectors, only Nifty Metal index stood out be the loser, while all others traded with gains. Nifty Realty index was the top sectoral performer, surging over 2 percent led by DLF, Macrotech Developers, Godrej Properties, and Phoenix Mills.\n\nALSO READ: Experts bet on these 10 stocks that may outperform market with healthy returns\n\nStory continues below Advertisement Remove Ad\n\nGlobal markets on a strong foot; all eyes on big tech earnings\n\nAll major averages in the US market ended on a positive note overnight as investors started to buy the dip across technology names. Traders are bracing up for mega-cap earnings this week - first by Tesla on April 23, followed by Meta, Alphabet, and Microsoft.\n\nDow Jones, tech-heavy NASDAQ Composite, and the S&P 500 indices gained up to 1 percent on April 22.\n\nAsia-Pacific markets mimicked strong moves from Wall Street and edged higher this morning. Japan's Nikkei 225 gained 0.1 percent, while Australia's S&P 200 was up 0.4 percent, and Hong Kong's Hang Seng index gained 0.9 percent.\n\nDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.",
    "source": "https://www.moneycontrol.com/rss/marketreports.xml",
    "published_date": "Tue, 23 Apr 2024 09:45:50 +0530",
    "summary": "<img align=\" left\" alt=\"Sensex, Nifty extend gains to 3rd day, Q4 results to guide stock-specific action\" border=\"0\" height=\"75\" hspace=\"5\" src=\"https://www.moneycontrol.com/news_image_files/2024/200x200/M/Market_up_200.jpg\" title=\"Sensex, Nifty extend gains to 3rd day, Q4 results to guide stock-specific action\" width=\"75\" /> India VIX, which measures near-term volatility saw a sharp fall of 18 percent to trade around 10.42"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/expert-view/etmarkets-nri-talk-equity-over-debt-nris-see-indian-markets-as-long-term-wealth-builders-says-harsh-gahlaut/articleshow/122968465.cms",
    "title": "ETMarkets NRI Talk| Equity over debt: NRIs see Indian markets as long-term wealth builders, says Harsh Gahlaut",
    "content": "Live Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nIn this edition of ETMarkets NRI Talk, we speak with Harsh Gahlaut, Co-founder & CEO of FinEdge, to decode the evolving investment preferences of non-resident Indians.With a growing number of NRIs channeling their money into Indian mutual funds, the trend clearly reflects more than just a quest for returns—it's about long-term conviction in India’s economic story.From emotional ties and strategic asset allocation to the increasing ease of digital investing, Harsh shares insights into why equity continues to dominate NRI portfolios, how taxation and regulation shape their decisions, and why India remains a core destination for wealth creation, despite the operational challenges. Edited Excerpts -A) Several key emotional and strategic factors are at play here. First, there’s a deep sense of familiarity and belonging, a kind of anchoring bias, that drives NRIs to invest in India. Despite living abroad, India remains home, and this emotional connection plays a significant role in financial decision-making and investment beliefs.Second, many NRIs are acutely aware of the Indian growth story. They hear about India’s rising global influence and see the potential firsthand, from macroeconomic stability and digital innovation to favourable demographics and long-term GDP prospects. That’s something many of them take pretty seriously, and it shows in the way they invest.Third, for a large number of NRIs, there's a long-term view, whether it's the intention to return, support family members, or simply have a solid financial foothold in India. Mutual funds become a natural choice because they offer professional management, diversification, and alignment with long-term goals, such as retirement, education, or legacy planning.A) Interestingly, tax efficiency is rarely the primary driver behind NRI investments in India. Most NRIs are driven more by long-term value, familiarity, and strategic diversification than tax efficiency alone. That said, the Double Taxation Avoidance Agreement (DTAA) certainly adds a layer of convenience and clarity. Despite the friction, India continues to hold a firm place in NRI investment portfolios, driven more by belief than by convenience.Depending on the treaty terms, NRIs may be eligible for reduced tax rates or claim a credit for taxes paid in India against their overseas tax liabilities. For instance, interest income or capital gains earned in India might be subject to lower TDS under DTAA provisions, easing the overall tax impact.That said, taxation is just one piece of a much larger puzzle. NRIs face a range of other practical challenges, including complex documentation requirements, understanding currency risk, and managing time zone differences when dealing with professionals based in India. In places like the US and Canada, regulatory filters make things even trickier — some mutual funds are simply off the table.NRIs also rely more heavily on service support, especially when it comes to tasks like KYC, nominee updates, or redemption documentation. For many, a lack of access to a trusted investment expert who can guide them virtually and collaboratively becomes a significant barrier.Despite these hurdles, most NRIs continue to look at India as a core part of their long-term investment strategy. The connection to home, coupled with India's long-term economic potential, outweighs these operational complexities for many investors.A) Interestingly, while these regions differ in culture and regulation, the investment mindset of NRIs across geographies is more similar than different, especially when it comes to long-term wealth creation.Regardless of where they are based, NRIs today want intelligent visibility into their portfolios and the confidence that someone has their goals mapped out with clarity.Across the board, we see a firm conviction in India’s growth story. Whether it’s an NRI in New York, Dubai, London, or Singapore, there is a shared belief in the long-term potential of the Indian economy, and a preference for staying invested with discipline.Most NRIs are not chasing quick returns. Instead, they’re looking for structured, goal-based investing, often with the support of an expert who can offer personalisation and process.This convergence in mindset likely stems from a few common factors. Many NRIs have global market exposure and, as a result, more rational expectations. Their savings potential, especially in rupee terms, tends to be higher.At the same time, busy professional lives and time constraints mean they value the presence of a trusted expert who can help them stay on track, manage their portfolios, and navigate life changes without constantly reacting to market noise.That said, we have noticed subtle preferences in how NRIs engage with investment platforms. In digitally mature markets like the US and Singapore, there is a stronger inclination toward platforms that offer complete transparency, real-time portfolio tracking, and guided engagement, not just transactional ease.That’s probably why blended models, where people and tech work together, feel more natural to them.The ability to collaborate, plan virtually, and review progress through a single seamless interface is something NRIs increasingly expect as part of their investment experience.A) While there’s often curiosity around sectors, we find that most NRIs aren’t sector-chasers in the traditional sense. Their approach tends to be long-term and goal-based rather than tactical or theme-driven.That said, we do see growing interest in areas that reflect India’s structural growth story. Their focus is less on thematic rotations and more on strategies that deliver results quietly over time.Broadly, sectors such as financial services, infrastructure, technology, and manufacturing, particularly those aligned with the 'Make in India' and capital expenditure (capex) revival narrative, are gaining investor confidence.We’re also seeing some interest in areas like renewable energy and the digital economy, largely thanks to India’s momentum in those spaces.Rather than making concentrated sectoral bets, most NRIs prefer diversified exposure through mutual funds or broader asset allocation strategies. They're usually more measured than domestic investors in responding to short-term market trends.Many have experienced the downside of being sold the wrong products in the past, especially insurance bundled as an investment. They are now more focused on transparency, cost efficiency, and long-term alignment with their goals.So, while promising sectors do exist, NRIs are generally not investing with a thematic focus. Their preference is for long-term, resilient strategies that benefit from India’s broader economic momentum, rather than timing individual sectors.A) The biggest shift we’ve seen is how digitalisation has made investing in India far more seamless and location-agnostic. NRIs today can transact, track, and review their investments from anywhere in the world, something that wasn’t as easy even a few years ago.Initiatives like Aadhaar-based KYC, digital signatures, and improved online reporting tools have reduced friction and brought transparency.That said, there are still operational gaps, especially in areas such as NRI onboarding, KYC updates, bank detail changes, or residency status modifications, which often still require offline intervention. But the intent to resolve these issues is clear, and we’re seeing steady progress toward end-to-end digital enablement.Another important development is the push around GIFT City, which offers NRIs and foreign investors access to certain investment options under a globally competitive tax and regulatory framework.It’s still early days, but as more product innovation and regulatory clarity evolve around GIFT City, it could become a meaningful channel for NRIs seeking efficient India exposure.To sum it up, India’s direction of reform is making it a lot easier and more future-ready for NRIs to invest back home, and the message to global investors, including NRIs, is clear: India is open, evolving, and becoming easier to engage with.A) For most NRIs, the India opportunity is still viewed through the lens of long-term growth, and that naturally draws them more toward equities. Their core motivation is participation in India’s economic trajectory, rather than locking into fixed-income instruments for yield.We do see fixed-income allocations being made for the purpose of asset diversification or short-term stability. However, tax-free bonds, government securities, or even newer retail products, such as government bonds or T-Bills, have yet to gain widespread traction among NRIs.They tend to be more relevant in specific cases, for instance, after a property sale, when certain capital gains exemptions are available through infrastructure bonds.Outside of those instances, NRIs who seek lower-risk exposure often still lean toward traditional options, such as fixed deposits. The familiarity and simplicity appeal to many, even if not the most tax-efficient.Additionally, for many NRIs, the risk of rupee depreciation is a factor, making long-duration, rupee-denominated debt instruments less attractive unless there’s a clear tax or regulatory incentive to justify the exposure.Broadly speaking, equity remains the preferred vehicle for long-term wealth creation, while fixed income continues to play a stabilising role, more complementary than core.(Disclaimer: Recommendations, suggestions, views, and opinions given by experts are their own. These do not represent the views of the Economic Times)",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Wed, 30 Jul 2025 09:00:00 +0530",
    "summary": "NRIs are increasingly investing in Indian mutual funds, driven by emotional connections, belief in India's growth story, and long-term financial goals. While taxation and regulations pose challenges, digitalization and government initiatives are making investments easier. Equities remain the preferred asset class, reflecting a conviction in India's economic potential, with fixed income playing a complementary role for diversification."
  },
  {
    "url": "https://www.moneycontrol.com/news/recommendations/buy-hdfc-bank-targetrs-1850-icici-securities_17531671.html",
    "title": "Buy HDFC Bank; target of Rs 1,850: ICICI Securities",
    "content": "Buy\n\nlive bse live\n\nnse live Volume Todays L/H More ×\n\nICICI Securitie's research report on HDFC Bank\n\nPost the merger, the bank has seen structural changes to the balance sheet in the form of sharp rise in LDR, lower CASA share and significant rise in the share of borrowing. The merger has also catapulted banks’ loan market share (m/s) by 330 bps to 14.5% while rise in deposits m/s is slower at 110bps YoY to 11.0%. We estimate the bank to deliver solid 18% CAGR in deposits for FY24-26 (absolute rise of INR 4.0-5.0 trillion per year) which also accounts for changed competitive landscape. Despite strong deposits growth, the bank is likely to focus on balanced LDR and borrowing substitution; thus we cut our loan growth estimate to 13% CAGR for FY24-26 with LDR easing to 100/96% for FY25/26 vs 104% now. Our implied incremental LDR comes at 74-75%. Overall, deposits accretion remains key variable impacting growth and NIM.\n\nStory continues below Advertisement Remove Ad\n\nOutlook\n\nWhile Q4FY24 NIM outcome was slightly better than expected, it appears partly driven by seasonality. We cut our EPS estimate by 5% for both FY25/26, mainly due to cut in growth estimates. We estimate the bank to deliver healthy RoA of 1.7% for FY25/26 with 14–15% RoE. Our target price remains unchanged at INR 1,850. Due to the sharp correction in stock price (down 10% YTD), we upgrade the stock to BUY. The re-rating is likely to be gradual as despite strong deposits growth, credit growth is likely to remain bit slower versus system and borrowing substitution is also likely to be gradual.\n\nFor all recommendations report, click here\n\nDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n\nICICI_HDFC_Bank230424",
    "source": "https://www.moneycontrol.com/rss/latestnews.xml",
    "published_date": "Tue, 23 Apr 2024 13:41:02 +0530",
    "summary": "<img align=\" left\" alt=\"Buy HDFC Bank; target of Rs 1,850: ICICI Securities\" border=\"0\" height=\"75\" hspace=\"5\" src=\"https://www.moneycontrol.com/news_image_files/2024/200x200/B/Buy-378x213_200.jpg\" title=\"Buy HDFC Bank; target of Rs 1,850: ICICI Securities\" width=\"75\" /> ICICI Securities is bullish on HDFC Bank has recommended buy rating on the stock with a target price of Rs 1,850 in its research report dated April 21, 2024."
  },
  {
    "url": "https://www.moneycontrol.com/news/recommendations/buy-tejas-networks-targetrs-1100-emkay-global-financial_17531621.html",
    "title": "Buy Tejas Networks; target of Rs 1100: Emkay Global Financial",
    "content": "buy\n\nlive bse live\n\nnse live Volume Todays L/H More ×\n\nEmkay Global Financial's research report on Tejas Networks\n\nTejas Networks reported a beat on our revenue and margin estimates, led by BSNL’s 4G project execution. We see Tejas benefits chiefly from: 1) GoI emphasis on domestic manufacturing and the PLI scheme; 2) large spends on BSNL, BharatNet, and the Railways; 3) references from TCom and TCS, thus adding new clients; and 4) global move towards replacing Chinese telecom equipment. We expect FY25E revenue to be 4x FY24 revenue on BSNL and Bharatnet execution. We increase revenue by 6%/7% for FY25E/FY26E on account of the beat on our revenue estimate. We also raise our EBITDA margin by 150-10bps on the margin beat.\n\nStory continues below Advertisement Remove Ad\n\nOutlook\n\nWe revise our TP to Rs1,100/share (21% upside) vs. Rs975 earlier, based on DCF methodology (WACC: 10.5%; Terminal growth rate: 6%). We retain our BUY rating.\n\nFor all recommendations report, click here\n\nDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n\nTejas Networks - 23042024 - emkay",
    "source": "https://www.moneycontrol.com/rss/latestnews.xml",
    "published_date": "Tue, 23 Apr 2024 13:36:47 +0530",
    "summary": "<img align=\" left\" alt=\"Buy Tejas Networks; target of Rs 1100: Emkay Global Financial\" border=\"0\" height=\"75\" hspace=\"5\" src=\"https://www.moneycontrol.com/news_image_files/2024/200x200/B/Buy_1280x720_1_200.jpg\" title=\"Buy Tejas Networks; target of Rs 1100: Emkay Global Financial\" width=\"75\" /> Emkay Global Financial is bullish on Tejas Networks has recommended buy rating on the stock with a target price of Rs 1100 in its research report dated April 23, 2024."
  },
  {
    "url": "https://www.moneycontrol.com/news/recommendations/buy-bajaj-finance-targetrs-9000-emkay-global-financial_17531641.html",
    "title": "Buy Bajaj Finance; target of Rs 9000: Emkay Global Financial",
    "content": "Buy\n\nlive bse live\n\nnse live Volume Todays L/H More ×\n\nEmkay Global Financial's research report on Bajaj Finance\n\nOur positive stance on the stock is underpinned by 3 factors: i) Flawless execution of strategic plans being BAF’s biggest strength; its execution capabilities are as strong as ever. ii) Near-term challenges/concerns—such as RBI actions on EMI and E-com cards, Management succession & transition plans, and listing of the housing subsidiary—have already been identified, and a resolution for each is likely within the next one year. iii) Continuing with its immaculate 3i execution strategy (Invent, Innovate and Imitate), the company is well poised to deliver consol. AUM CAGR of ~25% and consol. PAT CAGR of 21.4%, over FY24-27E. BAF shares have materially underperformed in the past few years and, as the company continues to make good progress on its ‘Long Range Strategy’ (LRS 2028) in terms of advancing its customer franchise (83.6mn) and AUM (3.8-4% of retail credit/3-3.25% of overall credit), the recent correction (in last 2yr) in valuations provides an attractive entry point.\n\n\n\nStory continues below Advertisement Remove Ad\n\nOutlook\n\nWe initiate coverage on Bajaj Finance (BAF) with a BUY recommendation and Mar-25E TP of Rs9,000/sh (~23.4% upside), implying FY26E consolidated P/B of 5.1x.\n\nFor all recommendations report, click here\n\nDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n\nBajaj Finance - 23042024 - emkay",
    "source": "https://www.moneycontrol.com/rss/latestnews.xml",
    "published_date": "Tue, 23 Apr 2024 13:36:44 +0530",
    "summary": "<img align=\" left\" alt=\"Buy Bajaj Finance; target of Rs 9000: Emkay Global Financial\" border=\"0\" height=\"75\" hspace=\"5\" src=\"https://www.moneycontrol.com/news_image_files/2024/200x200/B/Buy_1280x720_5_200.jpg\" title=\"Buy Bajaj Finance; target of Rs 9000: Emkay Global Financial\" width=\"75\" /> Emkay Global Financial is bullish on Bajaj Finance has recommended buy rating on the stock with a target price of Rs 9000 in its research report dated April 23, 2024."
  },
  {
    "url": "https://www.moneycontrol.com/news/recommendations/buy-bajaj-finance-targetrs-9000-emkay-global-financial_17531631.html",
    "title": "Latest News | Latest Business News | BSE | IPO News",
    "content": "You are already a Moneycontrol Pro user.\n\nOK",
    "source": "https://www.moneycontrol.com/rss/latestnews.xml",
    "published_date": "Tue, 23 Apr 2024 13:36:44 +0530",
    "summary": "<img align=\" left\" alt=\"Buy Bajaj Finance; target of Rs 9000: Emkay Global Financial\" border=\"0\" height=\"75\" hspace=\"5\" src=\"https://www.moneycontrol.com/news_image_files/2024/200x200/B/Buy_1280x720_5_200.jpg\" title=\"Buy Bajaj Finance; target of Rs 9000: Emkay Global Financial\" width=\"75\" /> Emkay Global Financial is bullish on Bajaj Finance has recommended buy rating on the stock with a target price of Rs 9000 in its research report dated April 23, 2024."
  },
  {
    "url": "https://www.moneycontrol.com/news/recommendations/reduce-persistent-systems-targetrs-3700-emkay-global-financial_17531581.html",
    "title": "Reduce Persistent Systems; target of Rs 3700: Emkay Global Financial",
    "content": "Reduce\n\nlive bse live\n\nnse live Volume Todays L/H More ×\n\nEmkay Global Financial's research report on Persistent Systems\n\nPersistent reported mixed performance in Q4 — revenue grew 3.4% QoQ CC, in line with our estimate, while margin of 14.5% (flat QoQ) missed it. Revenue growth still lopsided with HLS contributing ~94% of incremental revenue sequentially. Top client growth was impacted by a planned ramp down for the second consecutive quarter, while other large client growth was healthy. Deal wins TCV was USD447.7mn (1.4x book-to-bill), showing moderation with Q4 and TTM TCV up 6% and 12.6% YoY, respectively. Amid the challenging macros, the management aims for top-quartile growth in FY25E, while maintaining EBITM at FY24 levels. Company reiterated their medium-term target of improving EBITM by 200-300bps over the next 3 years.\n\n\n\nStory continues below Advertisement Remove Ad\n\nOutlook\n\nHowever, progress has been slow and target is shifted by a year; which is disappointing. Moderation in deal intake, Q4 performance, and slow progress on margin trajectory led to EPS cut of 5-6% for FY25-26E. Valuation remains rich even after today’s ~10% price correction. We retain REDUCE with a TP of Rs3,700/sh at 34x Mar-25E EPS.\n\nFor all recommendations report, click here\n\nDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n\nPersistent Systems - 23042024 - emkay",
    "source": "https://www.moneycontrol.com/rss/latestnews.xml",
    "published_date": "Tue, 23 Apr 2024 13:26:31 +0530",
    "summary": "<img align=\" left\" alt=\"Reduce Persistent Systems; target of Rs 3700: Emkay Global Financial\" border=\"0\" height=\"75\" hspace=\"5\" src=\"https://www.moneycontrol.com/news_image_files/2023/200x200/R/Reduce-2_200.jpg\" title=\"Reduce Persistent Systems; target of Rs 3700: Emkay Global Financial\" width=\"75\" /> Emkay Global Financial recommended reduce rating on Persistent Systems with a target price of Rs 3700 in its research report dated April 22, 2024."
  },
  {
    "url": "https://news.google.com/rss/articles/CBMingFBVV95cUxPOEhWN190TUtLTWVHekhZRF9rS2tMUnhnTXBnUzgzT3A5REFHQ3hIcDNhSDN0N3pDNkgwYTBsMTBxZWRZMjA1VGRBQW1Fdk1HUEp3TXBnUXVsN0NIdnlJUDJXNXV4YmlZTFo5TnJDYkFjcjZfOVNfVjZ6M0dkSEZ2SzV5MVUxVkR3T1NPS25hQmd1RGNvZ1htbDVyS05GUQ?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Wed, 30 Jul 2025 04:52:07 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMingFBVV95cUxPOEhWN190TUtLTWVHekhZRF9rS2tMUnhnTXBnUzgzT3A5REFHQ3hIcDNhSDN0N3pDNkgwYTBsMTBxZWRZMjA1VGRBQW1Fdk1HUEp3TXBnUXVsN0NIdnlJUDJXNXV4YmlZTFo5TnJDYkFjcjZfOVNfVjZ6M0dkSEZ2SzV5MVUxVkR3T1NPS25hQmd1RGNvZ1htbDVyS05GUQ?oc=5\" target=\"_blank\">World Economic Outlook Update, July 2025: Global Economy: Tenuous Resilience amid Persistent Uncertainty</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">International Monetary Fund</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMi0gFBVV95cUxPRG11UW5UdmNjV2ZFTExwTDlkaExOTVRZYm5NNUJhT015RU14MkNtZmRVU05tMlBwZEZHS090blBKenBBZkd4VVd1TGJvYmZiSW1lMkpTcUs4YWJPSkpVZG1TSElrNmVrNjc0Z19PRUhaRExlNldfeE1WWWYyZmpKUGVZeDZyQ24zak9QMHBFWnpkTkpWOVJwSFlORHZoVnVlbERqb3lfNlpkZGtjN3ZBRXVzVVJlaEd4S0c3Wk54RGpaOHhHS3VaYk1BTjNGYUNnV1HSAdcBQVVfeXFMTmFJeVJYTmlyMWVKMXdNYVh4c2xBMzRIWV9mYktuOTMwcmREUTY0T2hIQVR0dnBtQ2hhcHB2bGpMdThIYmY0am5TT0dQZUhVUmtuZXJVNDNVMEx1d0ExNGxRZUN2bHV4NGlxVEllcVpQNldPQmV2QUNxM08tMzh1QzYwaHNpYUFkMlp3NVlOWGlRUlItRWt1MVZiclU4bUZJRlI5SlVycWFyWUxXZWpWZ21CVnUxSzFNOTA4NmFtRFNYel9mTUFXcUJ3RnBtM3cyckJNVFhhMVU?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Wed, 30 Jul 2025 01:35:00 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi0gFBVV95cUxPRG11UW5UdmNjV2ZFTExwTDlkaExOTVRZYm5NNUJhT015RU14MkNtZmRVU05tMlBwZEZHS090blBKenBBZkd4VVd1TGJvYmZiSW1lMkpTcUs4YWJPSkpVZG1TSElrNmVrNjc0Z19PRUhaRExlNldfeE1WWWYyZmpKUGVZeDZyQ24zak9QMHBFWnpkTkpWOVJwSFlORHZoVnVlbERqb3lfNlpkZGtjN3ZBRXVzVVJlaEd4S0c3Wk54RGpaOHhHS3VaYk1BTjNGYUNnV1HSAdcBQVVfeXFMTmFJeVJYTmlyMWVKMXdNYVh4c2xBMzRIWV9mYktuOTMwcmREUTY0T2hIQVR0dnBtQ2hhcHB2bGpMdThIYmY0am5TT0dQZUhVUmtuZXJVNDNVMEx1d0ExNGxRZUN2bHV4NGlxVEllcVpQNldPQmV2QUNxM08tMzh1QzYwaHNpYUFkMlp3NVlOWGlRUlItRWt1MVZiclU4bUZJRlI5SlVycWFyWUxXZWpWZ21CVnUxSzFNOTA4NmFtRFNYel9mTUFXcUJ3RnBtM3cyckJNVFhhMVU?oc=5\" target=\"_blank\">Australia's second-quarter inflation drops to lowest since March 2021, supporting case for rate cut</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMitwFBVV95cUxOd1VueHktS25SMUZHemVJQXE0YkhZTlZhdVN4NjZCRk1nNVhCTzdLQUVXN0x1elZCVjAzanBuZkRfQzZQbmF6WTRmbWpBV0s5WlJDNW9KOWJuM2MtaHJwN1ROSmJ2YkR4NmI4X0hZUVJDNnVlUl9mZHRvOHRDbUFmOFoxa1lJR0hISTVuakE1aE41cFZDU0VtYXFTakJ3blctajFVbHRIZ0dCQkN1SkpCRm8xQ296NGc?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Wed, 30 Jul 2025 04:27:43 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMitwFBVV95cUxOd1VueHktS25SMUZHemVJQXE0YkhZTlZhdVN4NjZCRk1nNVhCTzdLQUVXN0x1elZCVjAzanBuZkRfQzZQbmF6WTRmbWpBV0s5WlJDNW9KOWJuM2MtaHJwN1ROSmJ2YkR4NmI4X0hZUVJDNnVlUl9mZHRvOHRDbUFmOFoxa1lJR0hISTVuakE1aE41cFZDU0VtYXFTakJ3blctajFVbHRIZ0dCQkN1SkpCRm8xQ296NGc?oc=5\" target=\"_blank\">Inflation slows again — but is it enough for the Reserve Bank to cut interest rates?</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Conversation</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNY0pMWFZhY0szUktMbTBOd3pHckhIQWhqQk5wTVVLSWw5Smp0MnJibGNJam1aMC1GcWJyZXJwTUhMYS1fT0otRUdUclh0VmVXVTQyVEFlMVBhenl5NzY1WUlVcXNpRkV0TVdtV2MwbUZxUTF6QTA3RzBGZmlfcmpwXw?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Wed, 30 Jul 2025 04:17:48 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxNY0pMWFZhY0szUktMbTBOd3pHckhIQWhqQk5wTVVLSWw5Smp0MnJibGNJam1aMC1GcWJyZXJwTUhMYS1fT0otRUdUclh0VmVXVTQyVEFlMVBhenl5NzY1WUlVcXNpRkV0TVdtV2MwbUZxUTF6QTA3RzBGZmlfcmpwXw?oc=5\" target=\"_blank\">Sensex, Nifty open flat; fed rate decision in focus</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">DD News</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxQYzlLNmlpSTdRbml5dlhhM1pjTE5MUUh3MWNTZnRSbUctTWcxSHYxTUZ0dkZ1VjdMVG8ySFpmOTFXclRtZ1JFbzVOUmpBZlhBc3V1UE9TYlVlOG9KZURXZTJhTHJDVUNTbWdCR1NJejU2Qll3cUkwYndORVFId2JZZURldjc0SlIwejBBdWMwSjV0M2RkZGNNYS1uNllzTXRTS0JfQlVUdkI1NHFCRmtnWk8tY0NGemhSMjJ1Y2Q5NnV5eDZX0gHKAUFVX3lxTE9ROHZlb1dRNjh0UDVfQ2p5NGM5VDdZa0RNNUxMclZfQ05fYXdrVFpYY3hBclNueEhHek53SlJMdzJqTXdPTldNeXV4c01xelg5TVdsTHNyWmV3cmNpSF9HLVVXMjl5Vnp1eUZVZlVEVXk1M3IyVmRBT1BNeE5ucmVqT3c2RkpNTGZmRlZOdFdqZ1lfN2lleVVMb3ZRaFR1VEhSWDg2RlpfS2ZTdWRTWGRDNTYtLUpHWGdLa1g3SGUyWVpzcjFZczF6LVE?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Wed, 30 Jul 2025 02:14:56 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMixAFBVV95cUxQYzlLNmlpSTdRbml5dlhhM1pjTE5MUUh3MWNTZnRSbUctTWcxSHYxTUZ0dkZ1VjdMVG8ySFpmOTFXclRtZ1JFbzVOUmpBZlhBc3V1UE9TYlVlOG9KZURXZTJhTHJDVUNTbWdCR1NJejU2Qll3cUkwYndORVFId2JZZURldjc0SlIwejBBdWMwSjV0M2RkZGNNYS1uNllzTXRTS0JfQlVUdkI1NHFCRmtnWk8tY0NGemhSMjJ1Y2Q5NnV5eDZX0gHKAUFVX3lxTE9ROHZlb1dRNjh0UDVfQ2p5NGM5VDdZa0RNNUxMclZfQ05fYXdrVFpYY3hBclNueEhHek53SlJMdzJqTXdPTldNeXV4c01xelg5TVdsTHNyWmV3cmNpSF9HLVVXMjl5Vnp1eUZVZlVEVXk1M3IyVmRBT1BNeE5ucmVqT3c2RkpNTGZmRlZOdFdqZ1lfN2lleVVMb3ZRaFR1VEhSWDg2RlpfS2ZTdWRTWGRDNTYtLUpHWGdLa1g3SGUyWVpzcjFZczF6LVE?oc=5\" target=\"_blank\">Gold holds steady ahead of Fed policy statement</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times</font>"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/indias-top-nine-private-banks-report-2-7-profit-growth-in-q1-amid-economic-challenges/articleshow/122985213.cms",
    "title": "India's top nine private banks report 2.7% profit growth in Q1 amid economic challenges",
    "content": "Agencies\n\nLive Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nMumbai: India's top nine private sector banks posted a combined net profit of ₹43,641 crore in the June quarter, marking a 2.7% growth, reflecting circumspect economic growth and tepid credit demand. An ET analysis showed that in the first quarter of FY25, the combined profits of these nine lenders had climbed 19% year-on-year.Growth was hindered by sluggish credit and deposit expansion. With core business momentum remaining weak, treasury gains played a significant role in supporting profitability.Analysts said the earnings of financial companies reflect stress across the board, especially at the less resourced end of the customer spectrum. \"The sum and substance is that the economy is grappling with lower growth; there are job creation and employment issues and there is stress manifesting as financials are seeing non-performing loans,\" said Suresh Ganapathy, head of financial services research, Macquarie Capital. \"The stress is more in the middle-income segment and also at the bottom of the pyramid.\"Subdued performances from Axis Bank RBL Bank and IDFC First Bank dragged down the overall earnings of private banks, which have been at the forefront of valuation gains in the sector and are traditional favourites of overseas funds. HDFC Bank made treasury gains of ₹10,110 crore and transaction gains of ₹9,130 crore from the sale of a stake in HDB Financial Services that debuted on stock exchanges. ICICI Bank booked treasury gains of ₹1,241 crore, while Axis Bank booked ₹1,420 crore of gains.\"I think the real growth numbers which will impress you, I would say it is still a couple of quarters away,\" Amitabh Chaudhry, MD & CEO, Axis Bank had told ET recently. Chaudhry has said the bank will grow faster than the industry this year.Kotak Mahindra Bank, which reported flat earnings growth, is also hoping to recover in the second half of the fiscal year. \"There have been some speed bumps,\" Ashok Vaswani, MD & CEO, Kotak Mahindra Bank told ET.“In the microfinance business, we started seeing stress in the third quarter of last year, Q1 (June quarter) we believe is the peak and Q2 will start coming down. This quarter, the retail part of commercial vehicles is clearly showing some stress.Credit cards take a little time to turn the super tanker around.” Yes Bank , which reported low single-digit deposit and loan growth, has said the September quarter would be the most challenging for the sector as credit growth remains sluggish and the full impact of the repo rate cut begins to flow through the system, weighing on margins.“Q2 would be the toughest quarter for the entire banking industry, because the 50-bps rate cut would lead to repricing of the entire loan book linked to external benchmarks, though deposits will take some time to reprice,” Prashant Kumar, MD & CEO, Yes Bank told ET. “Quarter 3 onwards I think it would stabilise, if there is no further rate cut.”",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Wed, 30 Jul 2025 05:27:16 +0530",
    "summary": "India's top private banks saw a slowdown in profit growth. Combined net profit reached ₹43,641 crore in the June quarter. This is a 2.7% increase, lower than the previous year. Sluggish credit and deposit growth impacted performance. Treasury gains helped support profitability. Some banks like Axis Bank and Kotak Mahindra Bank experienced subdued results."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/can-mb-engineerings-ipo-deliver-strong-returns-for-investors/articleshow/122985607.cms",
    "title": "Can M&B Engineering's IPO deliver strong returns for investors?",
    "content": "Agencies\n\nLive Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nET Intelligence Group: M&B Engineering, a manufacturer of fabricated steel structures pre-engineered buildings or PEB) and self-supported roofings, plans to raise ₹275 crore through fresh issue to fund capital expenditure and debt repayment and ₹375 crore through an offer for sale. The promoter stake will fall to 70.5% after the IPO from 100%. Its Sanand facility in Gujarat is the only PEB manufacturing facility in India with a certification from the American Institute of Steel Construction (AISC).The company has undertaken capacity expansion to cater to rising demand. It operates at a higher margin compared with peers. Given these factors, investors may consider the IPO for the long-term. Incorporated in 1981, Ahmedabad-headquartered M&B provides PEB and roofing solutions to customers across various sectors including engineering, manufacturing, food and beverages, warehousing, logistics, power, textiles, and railways.The company operates two manufacturing facilities each in Sanand and Cheyyar, Tamil Nadu, with a combined PEB capacity of 103,800 MTPA and 1,800,000 square metres per annum for self-supported roofing solutions as on March 2025. A part of the IPO proceeds will be used to increase the capacity at Sanand by 28% and at Cheyyar by 142% by FY28.Exports formed nearly 7% of the revenue in FY25. Top five customer groups contribute about 43% of its revenue. The company had an order book of ₹842.84 crore as of June 2025. Revenue from operations and net profit grew 6% and 53% annually to ₹988.6 crore and ₹77 crore, respectively between FY23 and FY25. Ebitda margin expanded to 12.8% from 7.5% during the period-margin for peers is between 2% and 10%.Debt-equity ratio is expected to fall to 0.1 after the IPO from 0.3. For peers, it is between 0.1 and 0.6. In FY25, 57% of the revenues came from repeat customers. Working capital days increased to 106 in FY25 from 60 in FY23. Considering the post-IPO equity and net profit for FY25, the company demands a P/E multiple of up to 29 vs P/Es between 30 and 34 for peers including Pennar Industries and Interarch Building Products.",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Wed, 30 Jul 2025 05:58:20 +0530",
    "summary": "M&amp;B Engineering plans to raise ₹650 crore through an IPO, including a fresh issue and offer for sale, to fund expansion and debt repayment. The company, known for its AISC-certified PEB facility and higher margins, will see promoter stake decrease post-IPO."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-6-stocks-close-cross-above-their-200-dma/bullish-momentum/slideshow/122987045.cms",
    "title": "Positive Breakout: These 6 stocks close cross above their 200 DMA - Bullish Momentum",
    "content": "In the Nifty500 pack, six stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on July 29, according to stockedge.com's technical scan data. The 200-day DMA is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:\n\n",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Wed, 30 Jul 2025 08:05:59 +0530",
    "summary": "In the Nifty500 pack, six stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on July 29, according to stockedge.com's technical scan data. The 200-day DMA is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/shanti-gold-international-ipo-allotment-out-today-heres-how-to-check-your-status/articleshow/122987073.cms",
    "title": "Shanti Gold International IPO allotment date today: Here's how to check your status",
    "content": "How to check Shanti Gold International IPO allotment?\n\nVisit Bigshare Services website (https://ipo.bigshareonline.com/ipo\\_status.html)\n\nFrom the dropdown, select ‘Shanti Gold International.’\n\nChoose one of the three options: PAN, Application Number, or DP Client ID\n\nWhat if you get a successful allotment of Shanti Gold International IPO?\n\n\n\nLive Events\n\nShanti Gold International IPO Listing and Allotment Date\n\nShanti Gold International IPO GMP\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe allotment status of the Shanti Gold International IPO is expected to be finalised today. Investors who applied in this mainboard offering can now check whether they’ve received any shares ahead of the stock’s scheduled listing on August 1 on the NSE and BSE.The public issue, entirely a fresh offering of 1.81 crore equity shares at Rs 199 apiece, saw solid demand from institutional and retail segments. It was subscribed across all categories and attracted Rs 108 crore from anchor investors on July 24.How to check Shanti Gold International IPO allotment: The allotment status can be checked on the website of the registrar, Bigshare Services.In case of successful allotment, the shares are expected to be credited to your demat account by Thursday. Refunds for unallocated investors will also be processed the same day.The company will debut on August 1, with the listing price closely watched given the strong financial growth and decent subscription. While the grey market premium has remained muted so far, the company’s fundamentals and anchor backing have raised hopes for a steady opening.Shanti Gold International, known for its intricate 22kt CZ casting jewellery, has grown its revenue by 56% and its net profit by over 100% year-on-year in FY25. It counts names like Joyalukkas and Lalitha Jewellery among its clients and plans to use IPO proceeds for expansion, working capital, and partial debt repayment.Investors are now keenly awaiting the stock’s debut on the bourses -- whether it shines bright or settles for a modest start.Shanti Gold International’s grey market premium (GMP) stood at Rs 38 as of July 30, 2025. Based on the IPO’s upper price band of Rs 199 per share, the implied listing price is estimated at Rs 237, translating to a potential upside of 19.1% over the issue price",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Wed, 30 Jul 2025 08:08:56 +0530",
    "summary": "Shanti Gold International IPO allotment status is expected to be finalized today, allowing investors to check their share allocation ahead of the August 1st NSE and BSE listing. The IPO, featuring 1.81 crore fresh equity shares at Rs 199 each, witnessed strong demand, including Rs 108 crore from anchor investors."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/laxmi-india-finance-ipo-subscribed-50-on-day-2-so-far-gmp-signals-5-listing-pop-should-you-subscribe/articleshow/122990506.cms",
    "title": "Laxmi India Finance IPO subscribed 50% on Day 2 so far, GMP signals 5% listing pop. Should you subscribe?",
    "content": "Laxmi India Finance IPO GMP\n\n\n\nIssue structure and use of proceeds\n\n\n\nLive Events\n\nCompany fundamentals and growth\n\n\n\nShould you subscribe to Laxmi India Finance IPO?\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Rs 254.26 crore initial public offering (IPO) of Laxmi India Finance, a Rajasthan-based non-banking financial company (NBFC) focused on MSME and vehicle loans, was subscribed 50% on the second day of bidding on Wednesday, driven by strong interest from retail and non-institutional investors.By 11:00 AM on day 2, the retail tranche had been bid by 83%, while the non-institutional investor (NII) category saw 26% subscription. The quota for qualified institutional buyers (QIBs) received 10% bids.As of July 30, the grey market premium (GMP) for Laxmi India Finance IPO stood at Rs 8.25. With the IPO’s upper price band set at Rs 158 per share, the implied listing price is Rs 166.25, a gain of about 5.2%.The IPO, which opened for subscription on July 29 and closes on July 31, is a book-built issue with a price band of Rs 150–158 per share. It comprises a fresh issue of 1.04 crore equity shares worth Rs 165.17 crore and an offer for sale (OFS) of 56.38 lakh shares worth Rs 89.09 crore by existing shareholders.The company intends to utilise the net proceeds from the fresh issue to strengthen its capital base and support future lending operations.Shares are proposed to be listed on both the BSE and NSE, with a tentative listing date of August 5.Retail investors can bid for a minimum lot size of 94 shares, amounting to Rs 14,852 at the upper end of the price band.Laxmi India Finance has built a strong footprint in rural and semi-urban lending. As of March 2025, the company reported assets under management (AUM) of Rs 1,277 crore, with MSME loans accounting for 76.34% of the portfolio. The loan book spans Rajasthan, Gujarat, Madhya Pradesh, and Chhattisgarh, supported by a branch network of 158 offices and over 35,500 active borrowers, many of them first-time credit customers.The company's revenue surged 42% year-on-year to Rs 248 crore in FY25, while profit after tax climbed 60% to Rs 36 crore. Backed by high-yield lending products and a focus on underserved markets, Laxmi India Finance positions itself as a scalable play on India’s growing formal credit ecosystem.Bajaj Broking recommends subscribing to the IPO from a long-term investment perspective. “Laxmi India Finance Limited (LIFL) focuses on catering to the financial needs of underserved customers, particularly in the MSME segment. Over the past three fiscal years, the company has shown steady growth in both total income and net profit, reporting Rs 130.67 crore / Rs 15.97 crore in FY23, Rs 175.02 crore / Rs 22.47 crore in FY24, and Rs 248.04 crore / Rs 36.01 crore in FY25,” the brokerage noted.The company’s average earnings per share (EPS) over the last three years stood at Rs 7.26, with an average return on net worth (RoNW) of 14.01%. Based on FY25 annualised earnings, the IPO is priced at a price-to-earnings (P/E) ratio of 22.93, and 36.74 based on FY24 earnings, according to the brokerage.PL Capital Markets is managing the IPO, while Link Intime has been appointed as the registrar.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Wed, 30 Jul 2025 11:40:58 +0530",
    "summary": "The Laxmi India Finance IPO, open for bidding from July 29 to 31, is a book-built offering with a price band of Rs 150–158 per share. The issue includes a fresh equity issuance of 1.04 crore shares aggregating Rs 165.17 crore and an OFS of 56.38 lakh shares valued at Rs 89.09 crore by existing shareholders."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/sri-lotus-developers-ipo-sees-5-subscription-on-day-1-so-far-should-you-apply-check-gmp-review-key-details/articleshow/122990023.cms",
    "title": "Sri Lotus Developers IPO sees 5% subscription on Day 1 so far. Should You Apply? Check GMP, Review & Key Details",
    "content": "Sri Lotus Developers IPO Subscription Status\n\n\n\nSri Lotus Developers IPO GMP today\n\n\n\nLive Events\n\nSri Lotus Developers company details\n\n\n\nShould You Subscribe?\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe initial public offering (IPO) of Sri Lotus Developers opened for subscription on Wednesday, July 30. As of 10:12 AM, overall subscription stood at 5%, with interest largely driven by retail and non-institutional investors. The IPO will remain open until August 1. In the grey market, shares are quoting at a premium, indicating a potential listing gain of around 29% over the upper price band of Rs 150 per share.Retail investors subscribed to 7% of the 1.97 crore shares allocated to them, while NIIs—such as high-net-worth individuals—subscribed to 9% of the 84.64 lakh shares reserved for their category. Meanwhile, Qualified Institutional Buyers (QIBs) have not placed any bids yet for their allotted 1.12 crore shares. However, it's worth noting that QIB interest often gathers momentum closer to the final days of the IPO, so a lack of early bids from this segment is fairly typical.According to market observers, the IPO is commanding a grey market premium (GMP) of Rs 44 per share. This suggests a potential listing gain of nearly 29% over the IPO’s upper price band of Rs 150. While GMPs are unofficial and speculative, they can reflect investor sentiment and expected demand.Sri Lotus Developers and Realty launched its Rs 792 crore IPO today, eyeing investor interest in the luxury real estate segment of Mumbai. The issue, which is entirely a fresh offer of 5.28 crore shares, will close on August 1. The price band has been set at Rs 140-150 per share, with a lot size of 100 shares.Proceeds from the IPO will be used to partly fund ongoing projects through its subsidiaries—including Amalfi, The Arcadian, and Varun—and for general corporate purposes.Sri Lotus Developers operates predominantly in Mumbai’s western suburbs, focusing on ultra-luxury and luxury housing through redevelopment and joint development models.The company had a net profit of Rs 228 crore in FY25, more than doubling from Rs 119 crore a year ago, on revenue of Rs 550 crore. Its EBITDA margin rose sharply to 52.6%, indicating strong profitability.Backed by a solid pipeline of 16 projects across Juhu, Andheri, Bandra, Prabhadevi, and Ghatkopar, Sri Lotus is betting big on the rising demand for homes in the Rs 2.5 crore-plus segment.The company follows an asset-light approach, largely avoiding land acquisition and instead partnering with housing societies—a model that has allowed faster execution and leaner capital deployment.Anand Rathi has issued a \"Subscribe - Long Term\" call, citing a strong execution track record, brand premium, and presence in high-demand micro-markets of Mumbai. It notes that while the valuation appears fully priced at 30.6 times FY25 earnings, the fundamentals support long-term wealth creation.Arihant Capital recommends the IPO for listing gains. The brokerage highlights the company’s ability to complete projects well before RERA timelines and its premium pricing power, especially in areas like Juhu.The IPO is being managed by Motilal Oswal and Monarch Networth , with shares set to be listed on both NSE and BSE.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Wed, 30 Jul 2025 11:17:52 +0530",
    "summary": "Sri Lotus Developers' IPO opened on July 30, witnessing 5% subscription driven by retail and NII investors. The IPO, priced at Rs 140-150, closes on August 1, with grey market premium indicating potential 29% listing gains. Anand Rathi suggests subscribing for the long term, citing strong fundamentals and Mumbai's luxury housing demand."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/aditya-infotech-ipo-subscribed-2-78x-on-day-2-should-you-apply-check-gmp-review-and-more/articleshow/122990387.cms",
    "title": "Aditya Infotech IPO subscribed 2.78x on Day 2; should you apply? Check GMP, review, and more",
    "content": "Aditya Infotech IPO Subscription Status\n\n\n\nAditya Infotech IPO GMP Today\n\n\n\nLive Events\n\nBusiness Overview and Financials\n\n\n\nAditya Infotech IPO Valuation and Recommendation\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nAditya Infotech’s Rs 1,300 crore IPO has been booked nearly three times as of the latest update on Day 2 of subscription on July 30. The IPO, open between July 29 and 31, had been subscribed 2.78 times overall, driven largely by strong demand from retail investors who booked their quota 8.83 times, as of 10:35 am. The company has priced the shares between Rs 640 and Rs 675 each. This IPO is a fresh issue of 1.93 crore new shares. In the grey market, the shares are trading at a premium, hinting at a possible listing gain of about 41.6% over the issue price of Rs 675.On the second day of bidding, Aditya Infotech's IPO was subscribed 2.78 times overall for the 1.12 crore shares available to the public. Retail investors showed strong interest, with their portion subscribed 8.83 times, while the Non-Institutional Investor (NII) category saw 4.34 times subscription. However, there has been minimal participation so far from Qualified Institutional Buyers (QIBs), who were allotted 60.65 lakh shares.Shares of Aditya Infotech are tentatively set to be listed on both the BSE and NSE on August 5.The grey market premium (GMP) for the IPO was seen at approximately Rs 281 over the issue price of Rs 675, indicating that the shares are trading unofficially at around Rs 956 ahead of their market debut. This translates to an expected listing gain of about 41.6%, reflecting strong investor sentiment and optimism around the IPO. While unofficial, the GMP offers a glimpse into market demand and potential performance before official listing.Aditya Infotech is a leading value-added distributor (VAD) in India for electronic security equipment. The company partners with global brands like Dahua, Seagate, TP-Link, Panasonic , and others, distributing across 650+ cities with over 15,000 channel partners.Its portfolio includes video surveillance products, access control systems, and networking solutions—catering to government, corporates, and SMEs.Between FY22 and FY24, the company’s revenue grew at a CAGR of 24%, from Rs 2,090 crore to Rs 3,212 crore. PAT grew from Rs 102 crore in FY22 to Rs 210 crore in FY24.EBITDA margins improved slightly from 9.6% to 10.7% over the same period. However, analysts note that the business remains working capital intensive and exposed to global supply chain risks.At the upper price band of Rs 675, Aditya Infotech is valued at a P/E of 36.2x on FY24 earnings, which is at a premium to industry peers like Redington and Ingram Micro. The IPO aims to raise funds primarily for working capital needs (Rs 600 crore), with the rest for general corporate purposes.Brokerage firm Bajaj Broking has rated the IPO as “Subscribe with Caution”. While acknowledging the company’s strong brand partnerships, consistent growth, and deep distribution network, the note flags its high valuation and moderate return ratios (RoE 22%, RoCE 20%) as concerns.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Wed, 30 Jul 2025 11:36:01 +0530",
    "summary": "Aditya Infotech’s Rs 1,300 crore IPO, a fresh issue of 1.93 crore shares, is open from July 29 to 31 with a price band of Rs 640–675 per share. Strong grey market signals suggest healthy listing gains for the electronic security equipment distributor."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/indiqube-spaces-shares-fall-8-after-weak-market-debut-what-should-investors-do/articleshow/122990555.cms",
    "title": "Indiqube Spaces shares fall 8% after weak market debut. What should investors do?",
    "content": "Live Events\n\nIndiqube Spaces IPO Details\n\n\n\nIndiqube Spaces Business Overview\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nShares of Indiqube Spaces fell nearly 8% to Rs 201.5 on the BSE after a tepid market debut on Wednesday. From its IPO price of Rs 237, the stock has slipped over 15% in early trade.The stock opened at Rs 218.7 on the BSE, marking a 7.7% discount to the issue price, while on the NSE, it debuted at Rs 216, down 8.9%.Sourav Choudhary, Managing Director at Raghunath Capital, said the muted listing reflects investor concerns.“The muted debut of Indiqube Spaces, listing nearly 8–9% below its issue price, clearly reflects market skepticism around valuation and the absence of near-term profitability. For short-term investors, the lack of listing gains and subdued grey market sentiment offer little incentive to enter at current levels.”He added that the company may still hold promise over a longer horizon.“That said, from a long-term investment lens, Indiqube’s business model remains relevant in a post-COVID world where flexible, managed workspaces are gaining traction. The company’s strong EBITDA margins and focused enterprise clientele offer scalability potential, especially if it can diversify beyond its heavy Bengaluru concentration.”“We are maintaining a ‘Neutral to Selective Long-Term Accumulate’ stance on Indiqube Spaces, with a close watch on its quarterly performance, cost structure, and expansion strategy beyond southern markets,” Choudhary said.The IPO, which ran from July 23 to July 25, comprised a fresh equity issue of Rs 650 crore and an offer for sale (OFS) of Rs 50 crore. The issue was priced at Rs 237 per share and raised Rs 314.32 crore from anchor investors ahead of the opening.Indiqube Spaces is a leading player in India’s managed office solutions segment. The company operates 105 centres across 15 cities, managing 8.4 million square feet of workspace.Its three core verticals—Indiqube Grow, Bespoke, and One—cater to different enterprise needs, offering ready-to-move-in workspaces in urban centres. Indiqube follows a capital-efficient model by leasing and refurbishing older buildings in high-demand locations.While the company has demonstrated strong revenue and operational growth, it remains loss-making, with a net loss of Rs 139.62 crore in FY25. However, the loss has narrowed compared to the previous fiscal year.Its proprietary tech platform MiQube offers digital access and services to clients, positioning Indiqube as a tech-forward player in the evolving commercial real estate landscape.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Wed, 30 Jul 2025 11:43:16 +0530",
    "summary": "Indiqube Spaces shares experienced a decline after a weak stock market debut, trading below the IPO price due to investor concerns about valuation and profitability. Despite short-term skepticism, the company's business model in flexible workspaces and strong EBITDA margins offer long-term potential. Analysts suggest a neutral stance, closely monitoring performance and expansion strategies."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/varun-beverages-shares-rally-over-4-after-q1-profit-jumps-81-sequentially/articleshow/122990442.cms",
    "title": "Varun Beverages shares rally over 4% after Q1 profit jumps 81% sequentially",
    "content": "Margin expansion and operational efficiency\n\n\n\nLive Events\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nShares of Varun Beverages climbed as much as 4.3% on Wednesday to Rs 534 on the BSE after PepsiCo’s bottling partner posted an 81.2% sequential jump in profit after tax (PAT) for the first quarter of FY26 and a 5% year-on-year (YoY) surge to Rs 1,325.49 crore, even as revenue declined and domestic sales volumes came under pressure.The company’s PAT rose from Rs 1,261.83 crore in Q1 FY25 and sharply from Rs 731.36 crore in the preceding March quarter. However, revenue from operations declined 2.3% YoY to Rs 7,333.67 crore from Rs 7,513 crore.In its Q1 FY26 results announced Tuesday, the company also declared an interim dividend of 25% of the face value, or Rs 0.50 per share, translating into a cash outflow of approximately Rs 169.1 crore.Despite a drop in top-line growth, the company delivered a stable gross margin of 54.5% and reported EBITDA of Rs 1,998.77 crore. The EBITDA margin expanded 82 basis points year-on-year to 28.5% in Q2 CY2025 from 27.7% in the same quarter a year ago.This margin expansion came despite higher fixed overheads from newly commissioned capacity at four greenfield plants in India, which are yet to contribute incremental volumes.” The company said this was driven by operational efficiencies and favourable currency movements in international markets.Sales volume in India fell 7.1%, while international markets showed strength with volumes rising 15.1%. South Africa led the overseas performance with a 16.1% increase, helping cushion the overall decline.Varun Beverages continued to maintain a strong financial footing, ending the quarter net debt-free with free cash of Rs 514.90 crore.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Wed, 30 Jul 2025 11:38:00 +0530",
    "summary": "Varun Beverages' shares surged following an impressive 5% year-on-year increase in profit after tax, reaching ₹1,325.49 crore for the first quarter of FY26. Despite a slight dip in revenue and domestic sales volume pressures, the company's strong performance was bolstered by margin expansion and operational efficiencies."
  },
  {
    "url": "https://news.google.com/rss/articles/CBMikAJBVV95cUxOZkluTTZERktteG1VcUVDTnlHcXFFd3pBR0xmclNRc3ZtRjRtcWZHclBibjF2QWdVTlJIS3ZRcnkwUV9TWU1yQkZjdXhmMGVNajZEVXp1WVFaVlZJZHM3bmVIcXl5Z0dWdVBWSVJFOUp1QXI1T1M1TlZzd09LWnlWRU4zczA5U2kySG5xSFNMOTJUUnF1TG5Yb2ZSWVZINjBDZFlIcE5zZTNTUGp6RGV0WjVVMGx2WHhyUXVadnZCdGxaRUh1ME5pTkxPai14czRxNzBfU19wbkZHMHZpWV9vTllGdnVpNEktV1RJMTFvclFKRzl3RGFzTmNVbzFDb3FRQjFhWDJQMmo0MzE3a183aNIBlgJBVV95cUxPRE5UNlhwSHBEVG5HeFk1RkJiN1RvSTNRLUN3bHg1c3FCQUo2MFlEclBCVEhaeklHQ2E2RlFrUFpTSG9sQU1BWm5LUjB1SnpfWjg0NmdGZU8zSVdvU0NpR21NN29ocTBseTZjQjhIQ1JHU3U4ME15dWZ0UTZIQUtmWGlwaVhPX0lKd3hWRlZFQVZmLVFlLXh6WEZYM3Y0Y2gzRzlNX2x1WWstR0x3Ym9hWmZvMUY0czN4S0xKenduQ2Y0RXUwN2R2d0pyakZqOGR5N3dRLWZGWVoxUmZDV0pOTXByY0VDU3BKQ2tYNUV0NUZBaXhWMXpfYl93eDNwSGpoQ2ZQYzBORExqX2dkajJHZ2VBT1hNQQ?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Wed, 30 Jul 2025 06:14:15 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMikAJBVV95cUxOZkluTTZERktteG1VcUVDTnlHcXFFd3pBR0xmclNRc3ZtRjRtcWZHclBibjF2QWdVTlJIS3ZRcnkwUV9TWU1yQkZjdXhmMGVNajZEVXp1WVFaVlZJZHM3bmVIcXl5Z0dWdVBWSVJFOUp1QXI1T1M1TlZzd09LWnlWRU4zczA5U2kySG5xSFNMOTJUUnF1TG5Yb2ZSWVZINjBDZFlIcE5zZTNTUGp6RGV0WjVVMGx2WHhyUXVadnZCdGxaRUh1ME5pTkxPai14czRxNzBfU19wbkZHMHZpWV9vTllGdnVpNEktV1RJMTFvclFKRzl3RGFzTmNVbzFDb3FRQjFhWDJQMmo0MzE3a183aNIBlgJBVV95cUxPRE5UNlhwSHBEVG5HeFk1RkJiN1RvSTNRLUN3bHg1c3FCQUo2MFlEclBCVEhaeklHQ2E2RlFrUFpTSG9sQU1BWm5LUjB1SnpfWjg0NmdGZU8zSVdvU0NpR21NN29ocTBseTZjQjhIQ1JHU3U4ME15dWZ0UTZIQUtmWGlwaVhPX0lKd3hWRlZFQVZmLVFlLXh6WEZYM3Y0Y2gzRzlNX2x1WWstR0x3Ym9hWmZvMUY0czN4S0xKenduQ2Y0RXUwN2R2d0pyakZqOGR5N3dRLWZGWVoxUmZDV0pOTXByY0VDU3BKQ2tYNUV0NUZBaXhWMXpfYl93eDNwSGpoQ2ZQYzBORExqX2dkajJHZ2VBT1hNQQ?oc=5\" target=\"_blank\">Indian economy highly resilient but China’s slowdown is affecting India's growth rate as well: Swaminathan</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Economic Times</font>"
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/rising-trend-ipos-from-tier-ii-and-iii-cities-in-india-gain-momentum/articleshow/123008489.cms",
    "title": "Rising Trend: IPOs from Tier II and III cities in India gain momentum",
    "content": "Synopsis\n\nIndian smaller cities are increasingly participating in the IPO market. Data shows a significant rise in the number of companies from these regions going public. They raised substantial funds through IPOs in recent years. This trend is expected to continue, with more companies planning to tap the capital markets.",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Thu, 31 Jul 2025 06:48:37 +0530",
    "summary": "Indian smaller cities are increasingly participating in the IPO market. Data shows a significant rise in the number of companies from these regions going public. They raised substantial funds through IPOs in recent years. This trend is expected to continue, with more companies planning to tap the capital markets."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-trumps-tariff-announcement-impact-indian-stock-market/articleshow/123007612.cms",
    "title": "How will Trump's tariff announcement impact Indian stock market?",
    "content": "Synopsis\n\nIndian equities are expected to decline following Trump's tariff announcement, as indicated by a drop in GIFT Nifty futures. Nilesh Shah of Kotak Mahindra AMC anticipates a negative market reaction, despite expectations of a trade deal due to aligned US-India strategic interests. Export-oriented sectors are likely to face the most significant impact.",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Thu, 31 Jul 2025 05:46:05 +0530",
    "summary": "Indian equities are expected to decline following Trump's tariff announcement, as indicated by a drop in GIFT Nifty futures. Nilesh Shah of Kotak Mahindra AMC anticipates a negative market reaction, despite expectations of a trade deal due to aligned US-India strategic interests. Export-oriented sectors are likely to face the most significant impact."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-3-stocks-that-may-give-returns-between-22-36/articleshow/123007717.cms",
    "title": "Hot Stocks: 3 stocks that may give returns between 22-36%",
    "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Thu, 31 Jul 2025 05:56:00 +0530",
    "summary": "Analysts predict significant returns for NTPC, Ather Energy, and Varun Beverages. CLSA projects a 35.4% upside for NTPC, citing continued re-rating. NUVAMA initiates coverage on Ather Energy with a buy rating, anticipating strong growth in the EV sector. HSBC reiterates a buy rating for Varun Beverages, forecasting a 22.6% upside due to attractive valuations and growth potential."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/jio-financial-to-raise-rs-15825-crore-via-preferential-issue/articleshow/123008592.cms",
    "title": "Jio Financial to raise Rs 15,825 crore via preferential issue",
    "content": "Synopsis\n\nJio Financial Services will raise ₹15,825 crore by issuing convertible warrants. Sikka Ports and Jamnagar Utilities will be issued these warrants. The capital will be used for investments in insurance and lending ventures. Jio has tied up with BlackRock for mutual funds. Jio Financial's board approved the issuance of warrants at Rs 316.50 apiece.",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Thu, 31 Jul 2025 06:54:59 +0530",
    "summary": "Jio Financial Services will raise ₹15,825 crore by issuing convertible warrants. Sikka Ports and Jamnagar Utilities will be issued these warrants. The capital will be used for investments in insurance and lending ventures. Jio has tied up with BlackRock for mutual funds. Jio Financial's board approved the issuance of warrants at Rs 316.50 apiece."
  },
  {
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/renol-polychem-ipo-opens-today-gmp-at-12-key-details-to-know-before-subscribing/articleshow/123009069.cms",
    "title": "Renol Polychem IPO opens today; GMP at 12%. Key details to know before subscribing",
    "content": "Surging revenue, strong return metrics\n\n\n\nLive Events\n\nUse of funds\n\n\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe initial public offering (IPO) of Renol Polychem opened for subscription on Thursday, with investor sentiment supported by strong financials and a grey market premium (GMP) of around 12%. The Rs 26 crore issue is entirely a fresh offer of 24.54 lakh equity shares and will close on August 4.Priced in the range of Rs 100 to Rs 105 per share, the IPO requires retail investors to apply for a minimum of 2,400 shares, translating into an investment of Rs 2.52 lakh. The shares are proposed to be listed on the NSE SME platform, with allotment expected on August 5 and listing tentatively scheduled for August 7.Anchor investors have already committed Rs 4.03 crore, subscribing to 3.84 lakh shares a day before the IPO launch.Founded in 2008, Renol Polychem is a manufacturer and supplier of colour masterbatches, filler masterbatches, polymer compounds, additives, and plastic pigments used across industries such as packaging, automotive, electronics, and agriculture.Its products enhance the performance, appearance, and durability of various plastic materials.The company has reported a dramatic revenue surge, with topline growing 859% to Rs 62.56 crore in FY25 from just Rs 6.52 crore in FY24. Profit after tax rose 226% to Rs 5 crore in the same period.Proceeds from the IPO will be used primarily for capital expenditure (Rs 5.6 crore), working capital (Rs 15.15 crore), loan repayment (Rs 1 crore), and general corporate purposes.",
    "source": "https://economictimes.indiatimes.com/rssfeedsdefault.cms",
    "published_date": "Thu, 31 Jul 2025 07:48:20 +0530",
    "summary": "Renol Polychem's IPO is set to launch on Thursday. Investor confidence is high, supported by robust financial performance. The IPO aims to raise Rs 26 crore through a fresh issue of shares. Anchor investors have already committed Rs 4.03 crore. The funds will be used for capital expenditure, working capital, and debt repayment."
  },
  {
    "url": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9xcWNMWmV5UWZVdGF3a0E0TDVCdUF0V1FjbVY5cmxaQW93TmZZalc2NEVfNU50alJXaFZ2WU9qeDZEb1lIQVFhUkxDWUY1Zy00MkpCV3JXNEpKQdIBX0FVX3lxTE43OUVGSWdtOUJ2eGpZY0xUa1pHOE0yVFJ6dnJTMGxsRHpwdmxndUoyMmUyNUx0Ykdud2ZHcEptdnFNRkFaNEd4X1RHMUJQX3JxWmY4QTZ1djMyLW43cnIw?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Thu, 31 Jul 2025 00:30:17 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiWkFVX3lxTE9xcWNMWmV5UWZVdGF3a0E0TDVCdUF0V1FjbVY5cmxaQW93TmZZalc2NEVfNU50alJXaFZ2WU9qeDZEb1lIQVFhUkxDWUY1Zy00MkpCV3JXNEpKQdIBX0FVX3lxTE43OUVGSWdtOUJ2eGpZY0xUa1pHOE0yVFJ6dnJTMGxsRHpwdmxndUoyMmUyNUx0Ykdud2ZHcEptdnFNRkFaNEd4X1RHMUJQX3JxWmY4QTZ1djMyLW43cnIw?oc=5\" target=\"_blank\">Fed holds interest rates steady despite Trump pressure</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">BBC</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMisAFBVV95cUxPdTYtV1JycDJkVllqblQtT0JfdVVGa295ZjVtSGN2T256VE1CY3hsdVMzZlpVUlh0UzdBMGhWUmJqX3RlQmNtSUF1NEZnd2lXQ3ZEZm9sMkRFSElQM1p1THFiQ1BqZF9xMDdZMGpDOElleFRFYVJydkkyQ19jby1MLTJFMV9YVXFma3lGQXVqdW9URkRXTXBvU01DSVE0NnFpTGxRY3NZd2pENDNEVlFVZw?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Wed, 30 Jul 2025 19:58:26 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMisAFBVV95cUxPdTYtV1JycDJkVllqblQtT0JfdVVGa295ZjVtSGN2T256VE1CY3hsdVMzZlpVUlh0UzdBMGhWUmJqX3RlQmNtSUF1NEZnd2lXQ3ZEZm9sMkRFSElQM1p1THFiQ1BqZF9xMDdZMGpDOElleFRFYVJydkkyQ19jby1MLTJFMV9YVXFma3lGQXVqdW9URkRXTXBvU01DSVE0NnFpTGxRY3NZd2pENDNEVlFVZw?oc=5\" target=\"_blank\">Powell Cites Inflation Risk as Fed Holds Interest Rates Steady</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQZjJvTzhaSXRWT1NfVzc0Ujg4cUZGVjRXOHN1eUhSdktFd215NzBZclpWS0pBc0hfdEJhN1pfRkFQUEQxcmhwck5WRmNUalRwU2ZTNzNqMnNPdW9NVGxmNk16WGNCbmM0QUlTajdRSjNBOG5aMWtEVUp0RGY2cXhKRllzQ2NZLUQyVXk2cGFSdDZ1S0g4Q18wcHdfSWVDbnJQLWZHRUNUWG41MncxUFZKQVpDTmxHLXIzYzNr?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Wed, 30 Jul 2025 23:17:07 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiuwFBVV95cUxQZjJvTzhaSXRWT1NfVzc0Ujg4cUZGVjRXOHN1eUhSdktFd215NzBZclpWS0pBc0hfdEJhN1pfRkFQUEQxcmhwck5WRmNUalRwU2ZTNzNqMnNPdW9NVGxmNk16WGNCbmM0QUlTajdRSjNBOG5aMWtEVUp0RGY2cXhKRllzQ2NZLUQyVXk2cGFSdDZ1S0g4Q18wcHdfSWVDbnJQLWZHRUNUWG41MncxUFZKQVpDTmxHLXIzYzNr?oc=5\" target=\"_blank\">Fed leaves rates steady despite Trump pressure, gives no hint of September cut</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMibkFVX3lxTE9MbnlPOUV2TWxRdElSdTNMazBwRGZ5Ulk4TnBCNlloMFE2Vy1qVnp0bWxsOE1yYlh4TWRaSUlZd2doZnZyUDhWNndFNDlQYTJyNG52enF0R0JtNTlpcHFxSUVKZVIzMzVBekhSc2x30gFzQVVfeXFMTlBkNmxCVHZXQkMtYWRpaV9GT1JSZ2NHdHd0cjhBRkQ1QzRwd0VMS0dHXzUtZldMZ0k3QTczZmRrcEFYREVZZDR5OTdWMkhlTjhJQWpWY2xjdmY1dUNBSkJsNW5WME1yd3htakppOTlMOWhUaw?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Wed, 30 Jul 2025 19:30:00 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE9MbnlPOUV2TWxRdElSdTNMazBwRGZ5Ulk4TnBCNlloMFE2Vy1qVnp0bWxsOE1yYlh4TWRaSUlZd2doZnZyUDhWNndFNDlQYTJyNG52enF0R0JtNTlpcHFxSUVKZVIzMzVBekhSc2x30gFzQVVfeXFMTlBkNmxCVHZXQkMtYWRpaV9GT1JSZ2NHdHd0cjhBRkQ1QzRwd0VMS0dHXzUtZldMZ0k3QTczZmRrcEFYREVZZDR5OTdWMkhlTjhJQWpWY2xjdmY1dUNBSkJsNW5WME1yd3htakppOTlMOWhUaw?oc=5\" target=\"_blank\">Fed recap: Powell says no decision on September, must wait to see tariff impact on inflation</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">CNBC</font>"
  },
  {
    "url": "https://news.google.com/rss/articles/CBMi1wFBVV95cUxQS1hnWVNhazExaU9jM2hHdVRmSF9JMHc1VWI3WUVWR0RHdlVFWkp0Z1Q2cThkUkdQaEF1a0tGcXNmNEhtZXVEZjcyNWVLTW5pdXlSWEdLaGdoUTM4N3Z6MGdjN1VYTFhpYzZGYkkxNUlmZ3hKZDB2SkNIT29iMkwxclVET0dIVHpzdGNLQVBiV3NNTFdyUWh4U3djQ213cmNGTHB2ZFpEc28yeTN3Sl9sdWMxQlhHaWItd0hCZUdhdzI0em15dkdnbDVUS3lvR3FhN1g4UGo2Yw?oc=5",
    "title": "Google News",
    "content": "",
    "source": "https://news.google.com/rss/search?q=economy+OR+inflation+OR+fed+-google&hl=en-IN&gl=IN&ceid=IN:en",
    "published_date": "Thu, 31 Jul 2025 04:42:02 GMT",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMi1wFBVV95cUxQS1hnWVNhazExaU9jM2hHdVRmSF9JMHc1VWI3WUVWR0RHdlVFWkp0Z1Q2cThkUkdQaEF1a0tGcXNmNEhtZXVEZjcyNWVLTW5pdXlSWEdLaGdoUTM4N3Z6MGdjN1VYTFhpYzZGYkkxNUlmZ3hKZDB2SkNIT29iMkwxclVET0dIVHpzdGNLQVBiV3NNTFdyUWh4U3djQ213cmNGTHB2ZFpEc28yeTN3Sl9sdWMxQlhHaWItd0hCZUdhdzI0em15dkdnbDVUS3lvR3FhN1g4UGo2Yw?oc=5\" target=\"_blank\">Trump Slams India: Calls Economy 'Dead', Criticizes High Tariffs and Russia Ties</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Deccan Herald</font>"
  }
]